podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
/**
 * @file      pin_mapping.h (derived from pin_mapping-MKM33Z5-Demo.h)
 * @version   1.2.0
 * @brief     Pin declarations for MKM33Z5-Demo, generated from MKM33Z5.csv
 *            Devices   [MKM33Z64xxx5, MKM33Z128xxx5]
 *            Reference [MKMxxZxxCxx5RM]
 */

#ifndef PROJECT_HEADERS_PIN_MAPPING_H_
#define PROJECT_HEADERS_PIN_MAPPING_H_

#include <stddef.h>
#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

//================================
// Validators
// <validate=net.sourceforge.usbdm.annotationEditor.validators.PinMappingValidator>

// Pin mapping Options
//
//   <q> Map pins 
//   <i> Selects whether pin mappings are done when individual
//   <i> peripherals are configured or during reset initialisation.
//     <0=> Pins mapped on demand
//     <1=> Pin mapping on reset
#define DO_MAP_PINS_ON_RESET 0

// Pin peripheral signal mapping
//   <e> Mapping by Pin <name=MAP_BY_PIN>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by individual pin
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_PIN_ENABLED   1

// <h> Miscellaneous Pins

// Signal mapping for EXTAL32K pin
//   <o>    EXTAL32K<name=EXTAL32K_SIG_SEL><constant>
//   <i>    EXTAL32K has no pin-mapping hardware
//   <info> EXTAL32K
//     <-3=> EXTAL32K (fixed)<selection=EXTAL32K_PIN_SEL,EXTAL32K>
#define EXTAL32K_SIG_SEL     -3

// Signal mapping for SDADM0 pin
//   <o>    SDADM0<name=SDADM0_SIG_SEL><constant>
//   <i>    SDADM0 has no pin-mapping hardware
//   <info> SDADM0
//     <-3=> SDADM0 (fixed)<selection=SDADM0_PIN_SEL,SDADM0>
#define SDADM0_SIG_SEL       -3

// Signal mapping for SDADM1 pin
//   <o>    SDADM1<name=SDADM1_SIG_SEL><constant>
//   <i>    SDADM1 has no pin-mapping hardware
//   <info> SDADM1
//     <-3=> SDADM1 (fixed)<selection=SDADM1_PIN_SEL,SDADM1>
#define SDADM1_SIG_SEL       -3

// Signal mapping for SDADM2 pin
//   <o>    SDADM2<name=SDADM2_SIG_SEL><constant>
//   <i>    SDADM2 has no pin-mapping hardware
//   <info> SDADM2/CMP1P3
//     <-3=> SDADM2/CMP1P3 (fixed)<selection=SDADM2_PIN_SEL,SDADM2><selection=CMP1P3_PIN_SEL,SDADM2>
#define SDADM2_SIG_SEL       -3

// Signal mapping for SDADM3 pin
//   <o>    SDADM3<name=SDADM3_SIG_SEL><constant>
//   <i>    SDADM3 has no pin-mapping hardware
//   <info> SDADM3/CMP1P5
//     <-3=> SDADM3/CMP1P5 (fixed)<selection=SDADM3_PIN_SEL,SDADM3><selection=CMP1P5_PIN_SEL,SDADM3>
#define SDADM3_SIG_SEL       -3

// Signal mapping for SDADP0 pin
//   <o>    SDADP0<name=SDADP0_SIG_SEL><constant>
//   <i>    SDADP0 has no pin-mapping hardware
//   <info> SDADP0
//     <-3=> SDADP0 (fixed)<selection=SDADP0_PIN_SEL,SDADP0>
#define SDADP0_SIG_SEL       -3

// Signal mapping for SDADP1 pin
//   <o>    SDADP1<name=SDADP1_SIG_SEL><constant>
//   <i>    SDADP1 has no pin-mapping hardware
//   <info> SDADP1
//     <-3=> SDADP1 (fixed)<selection=SDADP1_PIN_SEL,SDADP1>
#define SDADP1_SIG_SEL       -3

// Signal mapping for SDADP2 pin
//   <o>    SDADP2<name=SDADP2_SIG_SEL><constant>
//   <i>    SDADP2 has no pin-mapping hardware
//   <info> SDADP2/CMP1P2
//     <-3=> SDADP2/CMP1P2 (fixed)<selection=SDADP2_PIN_SEL,SDADP2><selection=CMP1P2_PIN_SEL,SDADP2>
#define SDADP2_SIG_SEL       -3

// Signal mapping for SDADP3 pin
//   <o>    SDADP3<name=SDADP3_SIG_SEL><constant>
//   <i>    SDADP3 has no pin-mapping hardware
//   <info> SDADP3/CMP1P4
//     <-3=> SDADP3/CMP1P4 (fixed)<selection=SDADP3_PIN_SEL,SDADP3><selection=CMP1P4_PIN_SEL,SDADP3>
#define SDADP3_SIG_SEL       -3

// Signal mapping for XTAL32K pin
//   <o>    XTAL32K<name=XTAL32K_SIG_SEL><constant>
//   <i>    XTAL32K has no pin-mapping hardware
//   <info> XTAL32K
//     <-3=> XTAL32K (fixed)<selection=XTAL32K_PIN_SEL,XTAL32K>
#define XTAL32K_SIG_SEL      -3

// </h>

// <h> Port A Pins

// Signal mapping for PTA0 pin
//   <o>    PTA0 (Alias:LED_RED)<name=PTA0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA0 pin
//   <info> LCD23, GPIOA_0
//     <-2=> Disabled (reset default)
//     <0=> LCD23<selection=LCD23_PIN_SEL,PTA0 (Alias:LED_RED)>
//     <1=> GPIOA_0<selection=GPIOA_0_PIN_SEL,PTA0 (Alias:LED_RED)>
//     <1=> Default
#define PTA0_SIG_SEL         1

// Signal mapping for PTA1 pin
//   <o>    PTA1 (Alias:LED_GREEN)<name=PTA1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA1 pin
//   <info> LCD24, GPIOA_1
//     <-2=> Disabled (reset default)
//     <0=> LCD24<selection=LCD24_PIN_SEL,PTA1 (Alias:LED_GREEN)>
//     <1=> GPIOA_1<selection=GPIOA_1_PIN_SEL,PTA1 (Alias:LED_GREEN)>
//     <1=> Default
#define PTA1_SIG_SEL         1

// Signal mapping for PTA2 pin
//   <o>    PTA2<name=PTA2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA2 pin
//   <info> LCD25, GPIOA_2
//     <-2=> Disabled (reset default)
//     <0=> LCD25<selection=LCD25_PIN_SEL,PTA2>
//     <1=> GPIOA_2<selection=GPIOA_2_PIN_SEL,PTA2>
//     <-2=> Default
#define PTA2_SIG_SEL         -2

// Signal mapping for PTA3 pin
//   <o>    PTA3<name=PTA3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA3 pin
//   <info> LCD26, GPIOA_3
//     <-2=> Disabled (reset default)
//     <0=> LCD26<selection=LCD26_PIN_SEL,PTA3>
//     <1=> GPIOA_3<selection=GPIOA_3_PIN_SEL,PTA3>
//     <-2=> Default
#define PTA3_SIG_SEL         -2

// Signal mapping for PTA4 pin
//   <o>    PTA4<name=PTA4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA4 pin
//   <info> LCD27, GPIOA_4, LLWU_P15, NMI_B
//     <-2=> NMI_B (reset default)<selection=NMI_B_PIN_SEL,PTA4 (reset default)>
//     <0=> LCD27<selection=LCD27_PIN_SEL,PTA4>
//     <1=> GPIOA_4<selection=GPIOA_4_PIN_SEL,PTA4>
//     <2=> LLWU_P15<selection=LLWU_P15_PIN_SEL,PTA4>
//     <7=> NMI_B<selection=NMI_B_PIN_SEL,PTA4>
//     <-2=> Default
#define PTA4_SIG_SEL         -2

// Signal mapping for PTA5 pin
//   <o>    PTA5<name=PTA5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA5 pin
//   <info> LCD28, GPIOA_5, CMP0OUT
//     <-2=> Disabled (reset default)
//     <0=> LCD28<selection=LCD28_PIN_SEL,PTA5>
//     <1=> GPIOA_5<selection=GPIOA_5_PIN_SEL,PTA5>
//     <2=> CMP0OUT<selection=CMP0OUT_PIN_SEL,PTA5>
//     <-2=> Default
#define PTA5_SIG_SEL         -2

