podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// Signal mapping for PTA6 pin
//   <o>    PTA6<name=PTA6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA6 pin
//   <info> LCD29, GPIOA_6, PXBAR_IN0, LLWU_P14
//     <-2=> Disabled (reset default)
//     <0=> LCD29<selection=LCD29_PIN_SEL,PTA6>
//     <1=> GPIOA_6<selection=GPIOA_6_PIN_SEL,PTA6>
//     <2=> PXBAR_IN0<selection=PXBAR_IN0_PIN_SEL,PTA6>
//     <3=> LLWU_P14<selection=LLWU_P14_PIN_SEL,PTA6>
//     <-2=> Default
#define PTA6_SIG_SEL         -2

// Signal mapping for PTA7 pin
//   <o>    PTA7<name=PTA7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTA7 pin
//   <info> LCD30, GPIOA_7, PXBAR_OUT0
//     <-2=> Disabled (reset default)
//     <0=> LCD30<selection=LCD30_PIN_SEL,PTA7>
//     <1=> GPIOA_7<selection=GPIOA_7_PIN_SEL,PTA7>
//     <2=> PXBAR_OUT0<selection=PXBAR_OUT0_PIN_SEL,PTA7>
//     <-2=> Default
#define PTA7_SIG_SEL         -2

// </h>

// <h> Port B Pins

// Signal mapping for PTB0 pin
//   <o>    PTB0<name=PTB0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB0 pin
//   <info> LCD31, GPIOB_0
//     <-2=> Disabled (reset default)
//     <0=> LCD31<selection=LCD31_PIN_SEL,PTB0>
//     <1=> GPIOB_0<selection=GPIOB_0_PIN_SEL,PTB0>
//     <-2=> Default
#define PTB0_SIG_SEL         -2

// Signal mapping for PTB1 pin
//   <o>    PTB1<name=PTB1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB1 pin
//   <info> LCD32, GPIOB_1
//     <-2=> Disabled (reset default)
//     <0=> LCD32<selection=LCD32_PIN_SEL,PTB1>
//     <1=> GPIOB_1<selection=GPIOB_1_PIN_SEL,PTB1>
//     <-2=> Default
#define PTB1_SIG_SEL         -2

// Signal mapping for PTB2 pin
//   <o>    PTB2<name=PTB2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB2 pin
//   <info> LCD33, GPIOB_2
//     <-2=> Disabled (reset default)
//     <0=> LCD33<selection=LCD33_PIN_SEL,PTB2>
//     <1=> GPIOB_2<selection=GPIOB_2_PIN_SEL,PTB2>
//     <-2=> Default
#define PTB2_SIG_SEL         -2

// Signal mapping for PTB3 pin
//   <o>    PTB3<name=PTB3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB3 pin
//   <info> LCD34, GPIOB_3
//     <-2=> Disabled (reset default)
//     <0=> LCD34<selection=LCD34_PIN_SEL,PTB3>
//     <1=> GPIOB_3<selection=GPIOB_3_PIN_SEL,PTB3>
//     <-2=> Default
#define PTB3_SIG_SEL         -2

// Signal mapping for PTB4 pin
//   <o>    PTB4<name=PTB4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB4 pin
//   <info> LCD35, GPIOB_4
//     <-2=> Disabled (reset default)
//     <0=> LCD35<selection=LCD35_PIN_SEL,PTB4>
//     <1=> GPIOB_4<selection=GPIOB_4_PIN_SEL,PTB4>
//     <-2=> Default
#define PTB4_SIG_SEL         -2

// Signal mapping for PTB5 pin
//   <o>    PTB5<name=PTB5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB5 pin
//   <info> LCD36, GPIOB_5
//     <-2=> Disabled (reset default)
//     <0=> LCD36<selection=LCD36_PIN_SEL,PTB5>
//     <1=> GPIOB_5<selection=GPIOB_5_PIN_SEL,PTB5>
//     <-2=> Default
#define PTB5_SIG_SEL         -2

// Signal mapping for PTB6 pin
//   <o>    PTB6<name=PTB6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB6 pin
//   <info> LCD37/CMP1P0, GPIOB_6
//     <-2=> Disabled (reset default)
//     <0=> LCD37/CMP1P0<selection=LCD37_PIN_SEL,PTB6><selection=CMP1P0_PIN_SEL,PTB6>
//     <1=> GPIOB_6<selection=GPIOB_6_PIN_SEL,PTB6>
//     <-2=> Default
#define PTB6_SIG_SEL         -2

// Signal mapping for PTB7 pin
//   <o>    PTB7<name=PTB7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTB7 pin
//   <info> LCD38, GPIOB_7, AFE_CLK
//     <-2=> Disabled (reset default)
//     <0=> LCD38<selection=LCD38_PIN_SEL,PTB7>
//     <1=> GPIOB_7<selection=GPIOB_7_PIN_SEL,PTB7>
//     <2=> AFE_CLK<selection=AFE_CLK_PIN_SEL,PTB7>
//     <-2=> Default
#define PTB7_SIG_SEL         -2

// </h>

// <h> Port C Pins

// Signal mapping for PTC0 pin
//   <o>    PTC0<name=PTC0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC0 pin
//   <info> LCD39, GPIOC_0, SCI3_RTS, PXBAR_IN1
//     <-2=> Disabled (reset default)
//     <0=> LCD39<selection=LCD39_PIN_SEL,PTC0>
//     <1=> GPIOC_0<selection=GPIOC_0_PIN_SEL,PTC0>
//     <2=> SCI3_RTS<selection=SCI3_RTS_PIN_SEL,PTC0>
//     <3=> PXBAR_IN1<selection=PXBAR_IN1_PIN_SEL,PTC0>
//     <-2=> Default
#define PTC0_SIG_SEL         -2

// Signal mapping for PTC1 pin
//   <o>    PTC1<name=PTC1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC1 pin
//   <info> LCD40/CMP1P1, GPIOC_1, SCI3_CTS
//     <-2=> Disabled (reset default)
//     <0=> LCD40/CMP1P1<selection=LCD40_PIN_SEL,PTC1><selection=CMP1P1_PIN_SEL,PTC1>
//     <1=> GPIOC_1<selection=GPIOC_1_PIN_SEL,PTC1>
//     <2=> SCI3_CTS<selection=SCI3_CTS_PIN_SEL,PTC1>
//     <-2=> Default
#define PTC1_SIG_SEL         -2

// Signal mapping for PTC2 pin
//   <o>    PTC2<name=PTC2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC2 pin
//   <info> LCD41, GPIOC_2, SCI3_TxD, PXBAR_OUT1
//     <-2=> Disabled (reset default)
//     <0=> LCD41<selection=LCD41_PIN_SEL,PTC2>
//     <1=> GPIOC_2<selection=GPIOC_2_PIN_SEL,PTC2>
//     <2=> SCI3_TxD<selection=SCI3_TxD_PIN_SEL,PTC2>
//     <3=> PXBAR_OUT1<selection=PXBAR_OUT1_PIN_SEL,PTC2>
//     <-2=> Default
#define PTC2_SIG_SEL         -2

// Signal mapping for PTC3 pin
//   <o>    PTC3<name=PTC3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC3 pin
//   <info> LCD42/CMP0P3, GPIOC_3, SCI3_RxD, LLWU_P13
//     <-2=> Disabled (reset default)
//     <0=> LCD42/CMP0P3<selection=LCD42_PIN_SEL,PTC3><selection=CMP0P3_PIN_SEL,PTC3>
//     <1=> GPIOC_3<selection=GPIOC_3_PIN_SEL,PTC3>
//     <2=> SCI3_RxD<selection=SCI3_RxD_PIN_SEL,PTC3>
//     <3=> LLWU_P13<selection=LLWU_P13_PIN_SEL,PTC3>
//     <-2=> Default
#define PTC3_SIG_SEL         -2

// Signal mapping for PTC4 pin
//   <o>    PTC4<name=PTC4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC4 pin
//   <info> LCD43, GPIOC_4
//     <-2=> Disabled (reset default)
//     <0=> LCD43<selection=LCD43_PIN_SEL,PTC4>
//     <1=> GPIOC_4<selection=GPIOC_4_PIN_SEL,PTC4>
//     <-2=> Default
#define PTC4_SIG_SEL         -2

// Signal mapping for PTC5 pin
//   <o>    PTC5<name=PTC5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC5 pin
//   <info> ADC0_SE0, GPIOC_5, SCI0_RTS, LLWU_P12
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE0<selection=ADC0_SE0_PIN_SEL,PTC5>
//     <1=> GPIOC_5<selection=GPIOC_5_PIN_SEL,PTC5>
//     <2=> SCI0_RTS<selection=SCI0_RTS_PIN_SEL,PTC5>
//     <3=> LLWU_P12<selection=LLWU_P12_PIN_SEL,PTC5>
//     <-2=> Default
#define PTC5_SIG_SEL         -2

// Signal mapping for PTC6 pin
//   <o>    PTC6<name=PTC6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC6 pin
//   <info> ADC0_SE1, GPIOC_6, SCI0_CTS, QT1
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE1<selection=ADC0_SE1_PIN_SEL,PTC6>
//     <1=> GPIOC_6<selection=GPIOC_6_PIN_SEL,PTC6>
//     <2=> SCI0_CTS<selection=SCI0_CTS_PIN_SEL,PTC6>
//     <3=> QT1<selection=QT1_PIN_SEL,PTC6>
//     <-2=> Default
#define PTC6_SIG_SEL         -2

// Signal mapping for PTC7 pin
//   <o>    PTC7<name=PTC7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTC7 pin
//   <info> ADC0_SE2, GPIOC_7, SCI0_TxD, PXBAR_OUT2
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE2<selection=ADC0_SE2_PIN_SEL,PTC7>
//     <1=> GPIOC_7<selection=GPIOC_7_PIN_SEL,PTC7>
//     <2=> SCI0_TxD<selection=SCI0_TxD_PIN_SEL,PTC7>
//     <3=> PXBAR_OUT2<selection=PXBAR_OUT2_PIN_SEL,PTC7>
//     <-2=> Default
#define PTC7_SIG_SEL         -2

