podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> Port D Pins

// Signal mapping for PTD0 pin
//   <o>    PTD0<name=PTD0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD0 pin
//   <info> CMP0P0, GPIOD_0, SCI0_RxD, PXBAR_IN2, LLWU_P11
//     <-2=> Disabled (reset default)
//     <0=> CMP0P0<selection=CMP0P0_PIN_SEL,PTD0>
//     <1=> GPIOD_0<selection=GPIOD_0_PIN_SEL,PTD0>
//     <2=> SCI0_RxD<selection=SCI0_RxD_PIN_SEL,PTD0>
//     <3=> PXBAR_IN2<selection=PXBAR_IN2_PIN_SEL,PTD0>
//     <4=> LLWU_P11<selection=LLWU_P11_PIN_SEL,PTD0>
//     <-2=> Default
#define PTD0_SIG_SEL         -2

// Signal mapping for PTD1 pin
//   <o>    PTD1 (Alias:LED_BLUE)<name=PTD1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD1 pin
//   <info> GPIOD_1, SCI1_TxD, SPI0_SS_B, PXBAR_OUT3, QT3
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_1<selection=GPIOD_1_PIN_SEL,PTD1 (Alias:LED_BLUE)>
//     <2=> SCI1_TxD<selection=SCI1_TxD_PIN_SEL,PTD1 (Alias:LED_BLUE)>
//     <3=> SPI0_SS_B<selection=SPI0_SS_B_PIN_SEL,PTD1 (Alias:LED_BLUE)>
//     <4=> PXBAR_OUT3<selection=PXBAR_OUT3_PIN_SEL,PTD1 (Alias:LED_BLUE)>
//     <5=> QT3<selection=QT3_PIN_SEL,PTD1 (Alias:LED_BLUE)>
//     <1=> Default
#define PTD1_SIG_SEL         1

// Signal mapping for PTD2 pin
//   <o>    PTD2<name=PTD2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD2 pin
//   <info> CMP0P1, GPIOD_2, SCI1_RxD, SPI0_SCK, PXBAR_IN3, LLWU_P10
//     <-2=> Disabled (reset default)
//     <0=> CMP0P1<selection=CMP0P1_PIN_SEL,PTD2>
//     <1=> GPIOD_2<selection=GPIOD_2_PIN_SEL,PTD2>
//     <2=> SCI1_RxD<selection=SCI1_RxD_PIN_SEL,PTD2>
//     <3=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTD2>
//     <4=> PXBAR_IN3<selection=PXBAR_IN3_PIN_SEL,PTD2>
//     <5=> LLWU_P10<selection=LLWU_P10_PIN_SEL,PTD2>
//     <-2=> Default
#define PTD2_SIG_SEL         -2

// Signal mapping for PTD3 pin
//   <o>    PTD3<name=PTD3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD3 pin
//   <info> GPIOD_3, SCI1_CTS, SPI0_MOSI
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_3<selection=GPIOD_3_PIN_SEL,PTD3>
//     <2=> SCI1_CTS<selection=SCI1_CTS_PIN_SEL,PTD3>
//     <3=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD3>
//     <-2=> Default
#define PTD3_SIG_SEL         -2

// Signal mapping for PTD4 pin
//   <o>    PTD4<name=PTD4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD4 pin
//   <info> ADC0_SE3, GPIOD_4, SCI1_RTS, SPI0_MISO, LLWU_P9
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE3<selection=ADC0_SE3_PIN_SEL,PTD4>
//     <1=> GPIOD_4<selection=GPIOD_4_PIN_SEL,PTD4>
//     <2=> SCI1_RTS<selection=SCI1_RTS_PIN_SEL,PTD4>
//     <3=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD4>
//     <4=> LLWU_P9<selection=LLWU_P9_PIN_SEL,PTD4>
//     <-2=> Default
#define PTD4_SIG_SEL         -2

// Signal mapping for PTD5 pin
//   <o>    PTD5<name=PTD5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD5 pin
//   <info> ADC0_SE4, GPIOD_5, LPTMR_ALT2, QT0, SCI3_CTS
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE4<selection=ADC0_SE4_PIN_SEL,PTD5>
//     <1=> GPIOD_5<selection=GPIOD_5_PIN_SEL,PTD5>
//     <2=> LPTMR_ALT2<selection=LPTMR_ALT2_PIN_SEL,PTD5>
//     <3=> QT0<selection=QT0_PIN_SEL,PTD5>
//     <4=> SCI3_CTS<selection=SCI3_CTS_PIN_SEL,PTD5>
//     <-2=> Default
#define PTD5_SIG_SEL         -2

// Signal mapping for PTD6 pin
//   <o>    PTD6<name=PTD6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD6 pin
//   <info> ADC0_SE5, GPIOD_6, LPTMR_ALT1, CMP1OUT, SCI3_RTS, LLWU_P8
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE5<selection=ADC0_SE5_PIN_SEL,PTD6>
//     <1=> GPIOD_6<selection=GPIOD_6_PIN_SEL,PTD6>
//     <2=> LPTMR_ALT1<selection=LPTMR_ALT1_PIN_SEL,PTD6>
//     <3=> CMP1OUT<selection=CMP1OUT_PIN_SEL,PTD6>
//     <4=> SCI3_RTS<selection=SCI3_RTS_PIN_SEL,PTD6>
//     <5=> LLWU_P8<selection=LLWU_P8_PIN_SEL,PTD6>
//     <-2=> Default
#define PTD6_SIG_SEL         -2

// Signal mapping for PTD7 pin
//   <o>    PTD7<name=PTD7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTD7 pin
//   <info> CMP0P4, GPIOD_7, I2C0_SCL, PXBAR_IN4, SCI3_RxD, LLWU_P7
//     <-2=> Disabled (reset default)
//     <0=> CMP0P4<selection=CMP0P4_PIN_SEL,PTD7>
//     <1=> GPIOD_7<selection=GPIOD_7_PIN_SEL,PTD7>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTD7>
//     <3=> PXBAR_IN4<selection=PXBAR_IN4_PIN_SEL,PTD7>
//     <4=> SCI3_RxD<selection=SCI3_RxD_PIN_SEL,PTD7>
//     <5=> LLWU_P7<selection=LLWU_P7_PIN_SEL,PTD7>
//     <-2=> Default
#define PTD7_SIG_SEL         -2

// </h>

// <h> Port E Pins

// Signal mapping for PTE0 pin
//   <o>    PTE0<name=PTE0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE0 pin
//   <info> GPIOE_0, I2C0_SDA, PXBAR_OUT4, SCI3_TxD, CLKOUT
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_0<selection=GPIOE_0_PIN_SEL,PTE0>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTE0>
//     <3=> PXBAR_OUT4<selection=PXBAR_OUT4_PIN_SEL,PTE0>
//     <4=> SCI3_TxD<selection=SCI3_TxD_PIN_SEL,PTE0>
//     <5=> CLKOUT<selection=CLKOUT_PIN_SEL,PTE0>
//     <-2=> Default
#define PTE0_SIG_SEL         -2

// Signal mapping for PTE1 pin
//   <o>    PTE1<name=PTE1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE1 pin
//   <info> GPIOE_1, RESET_B
//     <-2=> RESET_B (reset default)<selection=RESET_B_PIN_SEL,PTE1 (reset default)>
//     <1=> GPIOE_1<selection=GPIOE_1_PIN_SEL,PTE1>
//     <7=> RESET_B<selection=RESET_B_PIN_SEL,PTE1>
//     <-2=> Default
#define PTE1_SIG_SEL         -2

// Signal mapping for PTE2 pin
//   <o>    PTE2<name=PTE2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE2 pin
//   <info> EXTAL1, GPIOE_2, EWM_IN, PXBAR_IN6, I2C1_SDA
//     <-2=> EXTAL1 (reset default)<selection=EXTAL1_PIN_SEL,PTE2 (reset default)>
//     <0=> EXTAL1<selection=EXTAL1_PIN_SEL,PTE2>
//     <1=> GPIOE_2<selection=GPIOE_2_PIN_SEL,PTE2>
//     <2=> EWM_IN<selection=EWM_IN_PIN_SEL,PTE2>
//     <3=> PXBAR_IN6<selection=PXBAR_IN6_PIN_SEL,PTE2>
//     <4=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTE2>
//     <-2=> Default
#define PTE2_SIG_SEL         -2

// Signal mapping for PTE3 pin
//   <o>    PTE3<name=PTE3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE3 pin
//   <info> XTAL1, GPIOE_3, EWM_OUT, AFE_CLK, I2C1_SCL
//     <-2=> XTAL1 (reset default)<selection=XTAL1_PIN_SEL,PTE3 (reset default)>
//     <0=> XTAL1<selection=XTAL1_PIN_SEL,PTE3>
//     <1=> GPIOE_3<selection=GPIOE_3_PIN_SEL,PTE3>
//     <2=> EWM_OUT<selection=EWM_OUT_PIN_SEL,PTE3>
//     <3=> AFE_CLK<selection=AFE_CLK_PIN_SEL,PTE3>
//     <4=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTE3>
//     <-2=> Default
#define PTE3_SIG_SEL         -2

// Signal mapping for PTE4 pin
//   <o>    PTE4<name=PTE4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE4 pin
//   <info> GPIOE_4, LPTMR_ALT0, SCI2_CTS, EWM_IN
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_4<selection=GPIOE_4_PIN_SEL,PTE4>
//     <2=> LPTMR_ALT0<selection=LPTMR_ALT0_PIN_SEL,PTE4>
//     <3=> SCI2_CTS<selection=SCI2_CTS_PIN_SEL,PTE4>
//     <4=> EWM_IN<selection=EWM_IN_PIN_SEL,PTE4>
//     <-2=> Default
#define PTE4_SIG_SEL         -2

// Signal mapping for PTE5 pin
//   <o>    PTE5<name=PTE5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE5 pin
//   <info> GPIOE_5, QT3, SCI2_RTS, EWM_OUT, LLWU_P6
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_5<selection=GPIOE_5_PIN_SEL,PTE5>
//     <2=> QT3<selection=QT3_PIN_SEL,PTE5>
//     <3=> SCI2_RTS<selection=SCI2_RTS_PIN_SEL,PTE5>
//     <4=> EWM_OUT<selection=EWM_OUT_PIN_SEL,PTE5>
//     <5=> LLWU_P6<selection=LLWU_P6_PIN_SEL,PTE5>
//     <-2=> Default
#define PTE5_SIG_SEL         -2

// Signal mapping for PTE6 pin
//   <o>    PTE6<name=PTE6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE6 pin
//   <info> CMP0P2, GPIOE_6, PXBAR_IN5, SCI2_RxD, LLWU_P5, I2C0_SCL, SWD_IO
//     <-2=> SWD_IO (reset default)<selection=SWD_IO_PIN_SEL,PTE6 (reset default)>
//     <0=> CMP0P2<selection=CMP0P2_PIN_SEL,PTE6>
//     <1=> GPIOE_6<selection=GPIOE_6_PIN_SEL,PTE6>
//     <2=> PXBAR_IN5<selection=PXBAR_IN5_PIN_SEL,PTE6>
//     <3=> SCI2_RxD<selection=SCI2_RxD_PIN_SEL,PTE6>
//     <4=> LLWU_P5<selection=LLWU_P5_PIN_SEL,PTE6>
//     <5=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTE6>
//     <7=> SWD_IO<selection=SWD_IO_PIN_SEL,PTE6>
//     <-2=> Default
#define PTE6_SIG_SEL         -2

// Signal mapping for PTE7 pin
//   <o>    PTE7<name=PTE7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTE7 pin
//   <info> ADC0_SE6, GPIOE_7, PXBAR_OUT5, SCI2_TxD, I2C0_SDA, SWD_CLK
//     <-2=> SWD_CLK (reset default)<selection=SWD_CLK_PIN_SEL,PTE7 (reset default)>
//     <0=> ADC0_SE6<selection=ADC0_SE6_PIN_SEL,PTE7>
//     <1=> GPIOE_7<selection=GPIOE_7_PIN_SEL,PTE7>
//     <2=> PXBAR_OUT5<selection=PXBAR_OUT5_PIN_SEL,PTE7>
//     <3=> SCI2_TxD<selection=SCI2_TxD_PIN_SEL,PTE7>
//     <5=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTE7>
//     <7=> SWD_CLK<selection=SWD_CLK_PIN_SEL,PTE7>
//     <-2=> Default
#define PTE7_SIG_SEL         -2

