podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> Port F Pins

// Signal mapping for PTF0 pin
//   <o>    PTF0<name=PTF0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF0 pin
//   <info> ADC0_SE7, GPIOF_0, RTCCLKOUT, QT2, CMP0OUT, LLWU_P4
//     <-2=> Disabled (reset default)
//     <0=> ADC0_SE7<selection=ADC0_SE7_PIN_SEL,PTF0>
//     <1=> GPIOF_0<selection=GPIOF_0_PIN_SEL,PTF0>
//     <2=> RTCCLKOUT<selection=RTCCLKOUT_PIN_SEL,PTF0>
//     <3=> QT2<selection=QT2_PIN_SEL,PTF0>
//     <4=> CMP0OUT<selection=CMP0OUT_PIN_SEL,PTF0>
//     <5=> LLWU_P4<selection=LLWU_P4_PIN_SEL,PTF0>
//     <-2=> Default
#define PTF0_SIG_SEL         -2

// Signal mapping for PTF1 pin
//   <o>    PTF1<name=PTF1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF1 pin
//   <info> LCD0/ADC0_SE8, GPIOF_1, QT0, PXBAR_OUT6
//     <-2=> Disabled (reset default)
//     <0=> LCD0/ADC0_SE8<selection=LCD0_PIN_SEL,PTF1><selection=ADC0_SE8_PIN_SEL,PTF1>
//     <1=> GPIOF_1<selection=GPIOF_1_PIN_SEL,PTF1>
//     <2=> QT0<selection=QT0_PIN_SEL,PTF1>
//     <3=> PXBAR_OUT6<selection=PXBAR_OUT6_PIN_SEL,PTF1>
//     <-2=> Default
#define PTF1_SIG_SEL         -2

// Signal mapping for PTF2 pin
//   <o>    PTF2<name=PTF2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF2 pin
//   <info> LCD1/ADC0_SE9, GPIOF_2, CMP1OUT, RTCCLKOUT
//     <-2=> Disabled (reset default)
//     <0=> LCD1/ADC0_SE9<selection=LCD1_PIN_SEL,PTF2><selection=ADC0_SE9_PIN_SEL,PTF2>
//     <1=> GPIOF_2<selection=GPIOF_2_PIN_SEL,PTF2>
//     <2=> CMP1OUT<selection=CMP1OUT_PIN_SEL,PTF2>
//     <3=> RTCCLKOUT<selection=RTCCLKOUT_PIN_SEL,PTF2>
//     <-2=> Default
#define PTF2_SIG_SEL         -2

// Signal mapping for PTF3 pin
//   <o>    PTF3<name=PTF3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF3 pin
//   <info> LCD2, GPIOF_3, SPI1_SS_B, LPTMR_ALT1, SCI0_RxD
//     <-2=> Disabled (reset default)
//     <0=> LCD2<selection=LCD2_PIN_SEL,PTF3>
//     <1=> GPIOF_3<selection=GPIOF_3_PIN_SEL,PTF3>
//     <2=> SPI1_SS_B<selection=SPI1_SS_B_PIN_SEL,PTF3>
//     <3=> LPTMR_ALT1<selection=LPTMR_ALT1_PIN_SEL,PTF3>
//     <4=> SCI0_RxD<selection=SCI0_RxD_PIN_SEL,PTF3>
//     <-2=> Default
#define PTF3_SIG_SEL         -2

// Signal mapping for PTF4 pin
//   <o>    PTF4<name=PTF4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF4 pin
//   <info> LCD3, GPIOF_4, SPI1_SCK, LPTMR_ALT0, SCI0_TxD
//     <-2=> Disabled (reset default)
//     <0=> LCD3<selection=LCD3_PIN_SEL,PTF4>
//     <1=> GPIOF_4<selection=GPIOF_4_PIN_SEL,PTF4>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTF4>
//     <3=> LPTMR_ALT0<selection=LPTMR_ALT0_PIN_SEL,PTF4>
//     <4=> SCI0_TxD<selection=SCI0_TxD_PIN_SEL,PTF4>
//     <-2=> Default
#define PTF4_SIG_SEL         -2

// Signal mapping for PTF5 pin
//   <o>    PTF5<name=PTF5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF5 pin
//   <info> LCD4, GPIOF_5, SPI1_MISO, I2C1_SCL
//     <-2=> Disabled (reset default)
//     <0=> LCD4<selection=LCD4_PIN_SEL,PTF5>
//     <1=> GPIOF_5<selection=GPIOF_5_PIN_SEL,PTF5>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTF5>
//     <3=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTF5>
//     <-2=> Default
#define PTF5_SIG_SEL         -2

// Signal mapping for PTF6 pin
//   <o>    PTF6<name=PTF6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF6 pin
//   <info> LCD5, GPIOF_6, SPI1_MOSI, I2C1_SDA, LLWU_P3
//     <-2=> Disabled (reset default)
//     <0=> LCD5<selection=LCD5_PIN_SEL,PTF6>
//     <1=> GPIOF_6<selection=GPIOF_6_PIN_SEL,PTF6>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTF6>
//     <3=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTF6>
//     <4=> LLWU_P3<selection=LLWU_P3_PIN_SEL,PTF6>
//     <-2=> Default
#define PTF6_SIG_SEL         -2

// Signal mapping for PTF7 pin
//   <o>    PTF7<name=PTF7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTF7 pin
//   <info> LCD6, GPIOF_7, QT2, CLKOUT
//     <-2=> Disabled (reset default)
//     <0=> LCD6<selection=LCD6_PIN_SEL,PTF7>
//     <1=> GPIOF_7<selection=GPIOF_7_PIN_SEL,PTF7>
//     <2=> QT2<selection=QT2_PIN_SEL,PTF7>
//     <3=> CLKOUT<selection=CLKOUT_PIN_SEL,PTF7>
//     <-2=> Default
#define PTF7_SIG_SEL         -2

// </h>

// <h> Port G Pins

// Signal mapping for PTG0 pin
//   <o>    PTG0<name=PTG0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG0 pin
//   <info> LCD7, GPIOG_0, QT1, LPTMR_ALT2
//     <-2=> Disabled (reset default)
//     <0=> LCD7<selection=LCD7_PIN_SEL,PTG0>
//     <1=> GPIOG_0<selection=GPIOG_0_PIN_SEL,PTG0>
//     <2=> QT1<selection=QT1_PIN_SEL,PTG0>
//     <3=> LPTMR_ALT2<selection=LPTMR_ALT2_PIN_SEL,PTG0>
//     <-2=> Default
#define PTG0_SIG_SEL         -2

// Signal mapping for PTG1 pin
//   <o>    PTG1<name=PTG1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG1 pin
//   <info> LCD8/ADC0_SE10, GPIOG_1, LLWU_P2, LPTMR_ALT0
//     <-2=> Disabled (reset default)
//     <0=> LCD8/ADC0_SE10<selection=LCD8_PIN_SEL,PTG1><selection=ADC0_SE10_PIN_SEL,PTG1>
//     <1=> GPIOG_1<selection=GPIOG_1_PIN_SEL,PTG1>
//     <2=> LLWU_P2<selection=LLWU_P2_PIN_SEL,PTG1>
//     <3=> LPTMR_ALT0<selection=LPTMR_ALT0_PIN_SEL,PTG1>
//     <-2=> Default
#define PTG1_SIG_SEL         -2

// Signal mapping for PTG2 pin
//   <o>    PTG2<name=PTG2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG2 pin
//   <info> LCD9/ADC0_SE11, GPIOG_2, SPI0_SS_B, LLWU_P1
//     <-2=> Disabled (reset default)
//     <0=> LCD9/ADC0_SE11<selection=LCD9_PIN_SEL,PTG2><selection=ADC0_SE11_PIN_SEL,PTG2>
//     <1=> GPIOG_2<selection=GPIOG_2_PIN_SEL,PTG2>
//     <2=> SPI0_SS_B<selection=SPI0_SS_B_PIN_SEL,PTG2>
//     <3=> LLWU_P1<selection=LLWU_P1_PIN_SEL,PTG2>
//     <-2=> Default
#define PTG2_SIG_SEL         -2

// Signal mapping for PTG3 pin
//   <o>    PTG3<name=PTG3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG3 pin
//   <info> LCD10, GPIOG_3, SPI0_SCK, I2C0_SCL
//     <-2=> Disabled (reset default)
//     <0=> LCD10<selection=LCD10_PIN_SEL,PTG3>
//     <1=> GPIOG_3<selection=GPIOG_3_PIN_SEL,PTG3>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTG3>
//     <3=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTG3>
//     <-2=> Default
#define PTG3_SIG_SEL         -2

// Signal mapping for PTG4 pin
//   <o>    PTG4<name=PTG4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG4 pin
//   <info> LCD11, GPIOG_4, SPI0_MOSI, I2C0_SDA
//     <-2=> Disabled (reset default)
//     <0=> LCD11<selection=LCD11_PIN_SEL,PTG4>
//     <1=> GPIOG_4<selection=GPIOG_4_PIN_SEL,PTG4>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTG4>
//     <3=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTG4>
//     <-2=> Default
#define PTG4_SIG_SEL         -2

// Signal mapping for PTG5 pin
//   <o>    PTG5<name=PTG5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG5 pin
//   <info> LCD12, GPIOG_5, SPI0_MISO, LPTMR_ALT1
//     <-2=> Disabled (reset default)
//     <0=> LCD12<selection=LCD12_PIN_SEL,PTG5>
//     <1=> GPIOG_5<selection=GPIOG_5_PIN_SEL,PTG5>
//     <2=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTG5>
//     <3=> LPTMR_ALT1<selection=LPTMR_ALT1_PIN_SEL,PTG5>
//     <-2=> Default
#define PTG5_SIG_SEL         -2

// Signal mapping for PTG6 pin
//   <o>    PTG6<name=PTG6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG6 pin
//   <info> LCD13, GPIOG_6, LLWU_P0, LPTMR_ALT2
//     <-2=> Disabled (reset default)
//     <0=> LCD13<selection=LCD13_PIN_SEL,PTG6>
//     <1=> GPIOG_6<selection=GPIOG_6_PIN_SEL,PTG6>
//     <2=> LLWU_P0<selection=LLWU_P0_PIN_SEL,PTG6>
//     <3=> LPTMR_ALT2<selection=LPTMR_ALT2_PIN_SEL,PTG6>
//     <-2=> Default
#define PTG6_SIG_SEL         -2

// Signal mapping for PTG7 pin
//   <o>    PTG7<name=PTG7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTG7 pin
//   <info> LCD14, GPIOG_7
//     <-2=> Disabled (reset default)
//     <0=> LCD14<selection=LCD14_PIN_SEL,PTG7>
//     <1=> GPIOG_7<selection=GPIOG_7_PIN_SEL,PTG7>
//     <-2=> Default
#define PTG7_SIG_SEL         -2

