podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> Port H Pins

// Signal mapping for PTH0 pin
//   <o>    PTH0<name=PTH0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH0 pin
//   <info> LCD15, GPIOH_0
//     <-2=> Disabled (reset default)
//     <0=> LCD15<selection=LCD15_PIN_SEL,PTH0>
//     <1=> GPIOH_0<selection=GPIOH_0_PIN_SEL,PTH0>
//     <-2=> Default
#define PTH0_SIG_SEL         -2

// Signal mapping for PTH1 pin
//   <o>    PTH1<name=PTH1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH1 pin
//   <info> LCD16, GPIOH_1
//     <-2=> Disabled (reset default)
//     <0=> LCD16<selection=LCD16_PIN_SEL,PTH1>
//     <1=> GPIOH_1<selection=GPIOH_1_PIN_SEL,PTH1>
//     <-2=> Default
#define PTH1_SIG_SEL         -2

// Signal mapping for PTH2 pin
//   <o>    PTH2<name=PTH2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH2 pin
//   <info> LCD17, GPIOH_2
//     <-2=> Disabled (reset default)
//     <0=> LCD17<selection=LCD17_PIN_SEL,PTH2>
//     <1=> GPIOH_2<selection=GPIOH_2_PIN_SEL,PTH2>
//     <-2=> Default
#define PTH2_SIG_SEL         -2

// Signal mapping for PTH3 pin
//   <o>    PTH3<name=PTH3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH3 pin
//   <info> LCD18, GPIOH_3
//     <-2=> Disabled (reset default)
//     <0=> LCD18<selection=LCD18_PIN_SEL,PTH3>
//     <1=> GPIOH_3<selection=GPIOH_3_PIN_SEL,PTH3>
//     <-2=> Default
#define PTH3_SIG_SEL         -2

// Signal mapping for PTH4 pin
//   <o>    PTH4<name=PTH4_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH4 pin
//   <info> LCD19, GPIOH_4
//     <-2=> Disabled (reset default)
//     <0=> LCD19<selection=LCD19_PIN_SEL,PTH4>
//     <1=> GPIOH_4<selection=GPIOH_4_PIN_SEL,PTH4>
//     <-2=> Default
#define PTH4_SIG_SEL         -2

// Signal mapping for PTH5 pin
//   <o>    PTH5<name=PTH5_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH5 pin
//   <info> LCD20, GPIOH_5
//     <-2=> Disabled (reset default)
//     <0=> LCD20<selection=LCD20_PIN_SEL,PTH5>
//     <1=> GPIOH_5<selection=GPIOH_5_PIN_SEL,PTH5>
//     <-2=> Default
#define PTH5_SIG_SEL         -2

// Signal mapping for PTH6 pin
//   <o>    PTH6<name=PTH6_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH6 pin
//   <info> GPIOH_6, SCI1_CTS, SPI1_SS_B, PXBAR_IN7
//     <-2=> Disabled (reset default)
//     <1=> GPIOH_6<selection=GPIOH_6_PIN_SEL,PTH6>
//     <2=> SCI1_CTS<selection=SCI1_CTS_PIN_SEL,PTH6>
//     <3=> SPI1_SS_B<selection=SPI1_SS_B_PIN_SEL,PTH6>
//     <4=> PXBAR_IN7<selection=PXBAR_IN7_PIN_SEL,PTH6>
//     <-2=> Default
#define PTH6_SIG_SEL         -2

// Signal mapping for PTH7 pin
//   <o>    PTH7<name=PTH7_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTH7 pin
//   <info> GPIOH_7, SCI1_RTS, SPI1_SCK, PXBAR_OUT7
//     <-2=> Disabled (reset default)
//     <1=> GPIOH_7<selection=GPIOH_7_PIN_SEL,PTH7>
//     <2=> SCI1_RTS<selection=SCI1_RTS_PIN_SEL,PTH7>
//     <3=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTH7>
//     <4=> PXBAR_OUT7<selection=PXBAR_OUT7_PIN_SEL,PTH7>
//     <-2=> Default
#define PTH7_SIG_SEL         -2

// </h>

// <h> Port I Pins

// Signal mapping for PTI0 pin
//   <o>    PTI0<name=PTI0_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTI0 pin
//   <info> CMP0P5, GPIOI_0, SCI1_RxD, PXBAR_IN8, SPI1_MISO, SPI1_MOSI
//     <-2=> Disabled (reset default)
//     <0=> CMP0P5<selection=CMP0P5_PIN_SEL,PTI0>
//     <1=> GPIOI_0<selection=GPIOI_0_PIN_SEL,PTI0>
//     <2=> SCI1_RxD<selection=SCI1_RxD_PIN_SEL,PTI0>
//     <3=> PXBAR_IN8<selection=PXBAR_IN8_PIN_SEL,PTI0>
//     <4=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTI0>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTI0>
//     <-2=> Default
#define PTI0_SIG_SEL         -2

// Signal mapping for PTI1 pin
//   <o>    PTI1<name=PTI1_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTI1 pin
//   <info> GPIOI_1, SCI1_TxD, PXBAR_OUT8, SPI1_MOSI, SPI1_MISO
//     <-2=> Disabled (reset default)
//     <1=> GPIOI_1<selection=GPIOI_1_PIN_SEL,PTI1>
//     <2=> SCI1_TxD<selection=SCI1_TxD_PIN_SEL,PTI1>
//     <3=> PXBAR_OUT8<selection=PXBAR_OUT8_PIN_SEL,PTI1>
//     <4=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTI1>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTI1>
//     <-2=> Default
#define PTI1_SIG_SEL         -2

// Signal mapping for PTI2 pin
//   <o>    PTI2<name=PTI2_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTI2 pin
//   <info> LCD21, GPIOI_2
//     <-2=> Disabled (reset default)
//     <0=> LCD21<selection=LCD21_PIN_SEL,PTI2>
//     <1=> GPIOI_2<selection=GPIOI_2_PIN_SEL,PTI2>
//     <-2=> Default
#define PTI2_SIG_SEL         -2

// Signal mapping for PTI3 pin
//   <o>    PTI3<name=PTI3_SIG_SEL>
//   <i>    Selects which peripheral signal is mapped to PTI3 pin
//   <info> LCD22, GPIOI_3
//     <-2=> Disabled (reset default)
//     <0=> LCD22<selection=LCD22_PIN_SEL,PTI3>
//     <1=> GPIOI_3<selection=GPIOI_3_PIN_SEL,PTI3>
//     <-2=> Default
#define PTI3_SIG_SEL         -2

// </h>

// </e>

// Pin peripheral signal mapping
//   <e> Mapping by Peripheral Function <name=MAP_BY_FUNCTION><constant>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by peripheral function.
//   <i> This option is active when Mapping by Pin is disabled
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_FUNCTION_ENABLED 0

// <h> Miscellaneous

// Pin Mapping for LCD0 signal
//   <o>    LCD0<name=LCD0_PIN_SEL>
//   <i>    Shows which pin LCD0 is mapped to
//   <info>  [PTF1]
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,LCD0/ADC0_SE8>
//     <0=> Default
#define LCD0_PIN_SEL         0

// Pin Mapping for LCD1 signal
//   <o>    LCD1<name=LCD1_PIN_SEL>
//   <i>    Shows which pin LCD1 is mapped to
//   <info>  [PTF2]
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,LCD1/ADC0_SE9>
//     <0=> Default
#define LCD1_PIN_SEL         0

// Pin Mapping for LCD2 signal
//   <o>    LCD2<name=LCD2_PIN_SEL>
//   <i>    Shows which pin LCD2 is mapped to
//   <info>  [PTF3]
//     <0=> Disabled
//     <1=> PTF3<selection=PTF3_SIG_SEL,LCD2>
//     <0=> Default
#define LCD2_PIN_SEL         0

// Pin Mapping for LCD3 signal
//   <o>    LCD3<name=LCD3_PIN_SEL>
//   <i>    Shows which pin LCD3 is mapped to
//   <info>  [PTF4]
//     <0=> Disabled
//     <1=> PTF4<selection=PTF4_SIG_SEL,LCD3>
//     <0=> Default
#define LCD3_PIN_SEL         0

// Pin Mapping for LCD4 signal
//   <o>    LCD4<name=LCD4_PIN_SEL>
//   <i>    Shows which pin LCD4 is mapped to
//   <info>  [PTF5]
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,LCD4>
//     <0=> Default
#define LCD4_PIN_SEL         0

// Pin Mapping for LCD5 signal
//   <o>    LCD5<name=LCD5_PIN_SEL>
//   <i>    Shows which pin LCD5 is mapped to
//   <info>  [PTF6]
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,LCD5>
//     <0=> Default
#define LCD5_PIN_SEL         0

// Pin Mapping for LCD6 signal
//   <o>    LCD6<name=LCD6_PIN_SEL>
//   <i>    Shows which pin LCD6 is mapped to
//   <info>  [PTF7]
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,LCD6>
//     <0=> Default
#define LCD6_PIN_SEL         0

