podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// Pin Mapping for LCD7 signal
//   <o>    LCD7<name=LCD7_PIN_SEL>
//   <i>    Shows which pin LCD7 is mapped to
//   <info>  [PTG0]
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,LCD7>
//     <0=> Default
#define LCD7_PIN_SEL         0

// Pin Mapping for LCD8 signal
//   <o>    LCD8<name=LCD8_PIN_SEL>
//   <i>    Shows which pin LCD8 is mapped to
//   <info>  [PTG1]
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,LCD8/ADC0_SE10>
//     <0=> Default
#define LCD8_PIN_SEL         0

// Pin Mapping for LCD9 signal
//   <o>    LCD9<name=LCD9_PIN_SEL>
//   <i>    Shows which pin LCD9 is mapped to
//   <info>  [PTG2]
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,LCD9/ADC0_SE11>
//     <0=> Default
#define LCD9_PIN_SEL         0

// Pin Mapping for LCD10 signal
//   <o>    LCD10<name=LCD10_PIN_SEL>
//   <i>    Shows which pin LCD10 is mapped to
//   <info>  [PTG3]
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,LCD10>
//     <0=> Default
#define LCD10_PIN_SEL        0

// Pin Mapping for LCD11 signal
//   <o>    LCD11<name=LCD11_PIN_SEL>
//   <i>    Shows which pin LCD11 is mapped to
//   <info>  [PTG4]
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,LCD11>
//     <0=> Default
#define LCD11_PIN_SEL        0

// Pin Mapping for LCD12 signal
//   <o>    LCD12<name=LCD12_PIN_SEL>
//   <i>    Shows which pin LCD12 is mapped to
//   <info>  [PTG5]
//     <0=> Disabled
//     <1=> PTG5<selection=PTG5_SIG_SEL,LCD12>
//     <0=> Default
#define LCD12_PIN_SEL        0

// Pin Mapping for LCD13 signal
//   <o>    LCD13<name=LCD13_PIN_SEL>
//   <i>    Shows which pin LCD13 is mapped to
//   <info>  [PTG6]
//     <0=> Disabled
//     <1=> PTG6<selection=PTG6_SIG_SEL,LCD13>
//     <0=> Default
#define LCD13_PIN_SEL        0

// Pin Mapping for LCD14 signal
//   <o>    LCD14<name=LCD14_PIN_SEL>
//   <i>    Shows which pin LCD14 is mapped to
//   <info>  [PTG7]
//     <0=> Disabled
//     <1=> PTG7<selection=PTG7_SIG_SEL,LCD14>
//     <0=> Default
#define LCD14_PIN_SEL        0

// Pin Mapping for LCD15 signal
//   <o>    LCD15<name=LCD15_PIN_SEL>
//   <i>    Shows which pin LCD15 is mapped to
//   <info>  [PTH0]
//     <0=> Disabled
//     <1=> PTH0<selection=PTH0_SIG_SEL,LCD15>
//     <0=> Default
#define LCD15_PIN_SEL        0

// Pin Mapping for LCD16 signal
//   <o>    LCD16<name=LCD16_PIN_SEL>
//   <i>    Shows which pin LCD16 is mapped to
//   <info>  [PTH1]
//     <0=> Disabled
//     <1=> PTH1<selection=PTH1_SIG_SEL,LCD16>
//     <0=> Default
#define LCD16_PIN_SEL        0

// Pin Mapping for LCD17 signal
//   <o>    LCD17<name=LCD17_PIN_SEL>
//   <i>    Shows which pin LCD17 is mapped to
//   <info>  [PTH2]
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,LCD17>
//     <0=> Default
#define LCD17_PIN_SEL        0

// Pin Mapping for LCD18 signal
//   <o>    LCD18<name=LCD18_PIN_SEL>
//   <i>    Shows which pin LCD18 is mapped to
//   <info>  [PTH3]
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,LCD18>
//     <0=> Default
#define LCD18_PIN_SEL        0

// Pin Mapping for LCD19 signal
//   <o>    LCD19<name=LCD19_PIN_SEL>
//   <i>    Shows which pin LCD19 is mapped to
//   <info>  [PTH4]
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,LCD19>
//     <0=> Default
#define LCD19_PIN_SEL        0

// Pin Mapping for LCD20 signal
//   <o>    LCD20<name=LCD20_PIN_SEL>
//   <i>    Shows which pin LCD20 is mapped to
//   <info>  [PTH5]
//     <0=> Disabled
//     <1=> PTH5<selection=PTH5_SIG_SEL,LCD20>
//     <0=> Default
#define LCD20_PIN_SEL        0

// Pin Mapping for LCD21 signal
//   <o>    LCD21<name=LCD21_PIN_SEL>
//   <i>    Shows which pin LCD21 is mapped to
//   <info>  [PTI2]
//     <0=> Disabled
//     <1=> PTI2<selection=PTI2_SIG_SEL,LCD21>
//     <0=> Default
#define LCD21_PIN_SEL        0

// Pin Mapping for LCD22 signal
//   <o>    LCD22<name=LCD22_PIN_SEL>
//   <i>    Shows which pin LCD22 is mapped to
//   <info>  [PTI3]
//     <0=> Disabled
//     <1=> PTI3<selection=PTI3_SIG_SEL,LCD22>
//     <0=> Default
#define LCD22_PIN_SEL        0

// Pin Mapping for LCD23 signal
//   <o>    LCD23<name=LCD23_PIN_SEL>
//   <i>    Shows which pin LCD23 is mapped to
//   <info>  [PTA0]
//     <0=> Disabled
//     <1=> PTA0 (Alias:LED_RED)<selection=PTA0_SIG_SEL,LCD23>
//     <0=> Default
#define LCD23_PIN_SEL        0

// Pin Mapping for LCD24 signal
//   <o>    LCD24<name=LCD24_PIN_SEL>
//   <i>    Shows which pin LCD24 is mapped to
//   <info>  [PTA1]
//     <0=> Disabled
//     <1=> PTA1 (Alias:LED_GREEN)<selection=PTA1_SIG_SEL,LCD24>
//     <0=> Default
#define LCD24_PIN_SEL        0

// Pin Mapping for LCD25 signal
//   <o>    LCD25<name=LCD25_PIN_SEL>
//   <i>    Shows which pin LCD25 is mapped to
//   <info>  [PTA2]
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,LCD25>
//     <0=> Default
#define LCD25_PIN_SEL        0

// Pin Mapping for LCD26 signal
//   <o>    LCD26<name=LCD26_PIN_SEL>
//   <i>    Shows which pin LCD26 is mapped to
//   <info>  [PTA3]
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,LCD26>
//     <0=> Default
#define LCD26_PIN_SEL        0

// Pin Mapping for LCD27 signal
//   <o>    LCD27<name=LCD27_PIN_SEL>
//   <i>    Shows which pin LCD27 is mapped to
//   <info>  [PTA4]
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,LCD27>
//     <0=> Default
#define LCD27_PIN_SEL        0

// Pin Mapping for LCD28 signal
//   <o>    LCD28<name=LCD28_PIN_SEL>
//   <i>    Shows which pin LCD28 is mapped to
//   <info>  [PTA5]
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,LCD28>
//     <0=> Default
#define LCD28_PIN_SEL        0

// Pin Mapping for LCD29 signal
//   <o>    LCD29<name=LCD29_PIN_SEL>
//   <i>    Shows which pin LCD29 is mapped to
//   <info>  [PTA6]
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,LCD29>
//     <0=> Default
#define LCD29_PIN_SEL        0

// Pin Mapping for LCD30 signal
//   <o>    LCD30<name=LCD30_PIN_SEL>
//   <i>    Shows which pin LCD30 is mapped to
//   <info>  [PTA7]
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,LCD30>
//     <0=> Default
#define LCD30_PIN_SEL        0

// Pin Mapping for LCD31 signal
//   <o>    LCD31<name=LCD31_PIN_SEL>
//   <i>    Shows which pin LCD31 is mapped to
//   <info>  [PTB0]
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,LCD31>
//     <0=> Default
#define LCD31_PIN_SEL        0

// Pin Mapping for LCD32 signal
//   <o>    LCD32<name=LCD32_PIN_SEL>
//   <i>    Shows which pin LCD32 is mapped to
//   <info>  [PTB1]
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,LCD32>
//     <0=> Default
#define LCD32_PIN_SEL        0

// Pin Mapping for LCD33 signal
//   <o>    LCD33<name=LCD33_PIN_SEL>
//   <i>    Shows which pin LCD33 is mapped to
//   <info>  [PTB2]
//     <0=> Disabled
//     <1=> PTB2<selection=PTB2_SIG_SEL,LCD33>
//     <0=> Default
#define LCD33_PIN_SEL        0

// Pin Mapping for LCD34 signal
//   <o>    LCD34<name=LCD34_PIN_SEL>
//   <i>    Shows which pin LCD34 is mapped to
//   <info>  [PTB3]
//     <0=> Disabled
//     <1=> PTB3<selection=PTB3_SIG_SEL,LCD34>
//     <0=> Default
#define LCD34_PIN_SEL        0

