podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// Pin Mapping for LCD35 signal
//   <o>    LCD35<name=LCD35_PIN_SEL>
//   <i>    Shows which pin LCD35 is mapped to
//   <info>  [PTB4]
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,LCD35>
//     <0=> Default
#define LCD35_PIN_SEL        0

// Pin Mapping for LCD36 signal
//   <o>    LCD36<name=LCD36_PIN_SEL>
//   <i>    Shows which pin LCD36 is mapped to
//   <info>  [PTB5]
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,LCD36>
//     <0=> Default
#define LCD36_PIN_SEL        0

// Pin Mapping for LCD37 signal
//   <o>    LCD37<name=LCD37_PIN_SEL>
//   <i>    Shows which pin LCD37 is mapped to
//   <info>  [PTB6]
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,LCD37/CMP1P0>
//     <0=> Default
#define LCD37_PIN_SEL        0

// Pin Mapping for LCD38 signal
//   <o>    LCD38<name=LCD38_PIN_SEL>
//   <i>    Shows which pin LCD38 is mapped to
//   <info>  [PTB7]
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,LCD38>
//     <0=> Default
#define LCD38_PIN_SEL        0

// Pin Mapping for LCD39 signal
//   <o>    LCD39<name=LCD39_PIN_SEL>
//   <i>    Shows which pin LCD39 is mapped to
//   <info>  [PTC0]
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,LCD39>
//     <0=> Default
#define LCD39_PIN_SEL        0

// Pin Mapping for LCD40 signal
//   <o>    LCD40<name=LCD40_PIN_SEL>
//   <i>    Shows which pin LCD40 is mapped to
//   <info>  [PTC1]
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,LCD40/CMP1P1>
//     <0=> Default
#define LCD40_PIN_SEL        0

// Pin Mapping for LCD41 signal
//   <o>    LCD41<name=LCD41_PIN_SEL>
//   <i>    Shows which pin LCD41 is mapped to
//   <info>  [PTC2]
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,LCD41>
//     <0=> Default
#define LCD41_PIN_SEL        0

// Pin Mapping for LCD42 signal
//   <o>    LCD42<name=LCD42_PIN_SEL>
//   <i>    Shows which pin LCD42 is mapped to
//   <info>  [PTC3]
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LCD42/CMP0P3>
//     <0=> Default
#define LCD42_PIN_SEL        0

// Pin Mapping for LCD43 signal
//   <o>    LCD43<name=LCD43_PIN_SEL>
//   <i>    Shows which pin LCD43 is mapped to
//   <info>  [PTC4]
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,LCD43>
//     <0=> Default
#define LCD43_PIN_SEL        0

// </h>

// <h> Analogue to Digital (ADC0)

// Pin Mapping for ADC0_SE0 signal
//   <o>    ADC0_SE0<name=ADC0_SE0_PIN_SEL>
//   <i>    Shows which pin ADC0_SE0 is mapped to
//   <info>  [PTC5]
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,ADC0_SE0>
//     <0=> Default
#define ADC0_SE0_PIN_SEL     0

// Pin Mapping for ADC0_SE1 signal
//   <o>    ADC0_SE1<name=ADC0_SE1_PIN_SEL>
//   <i>    Shows which pin ADC0_SE1 is mapped to
//   <info>  [PTC6]
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,ADC0_SE1>
//     <0=> Default
#define ADC0_SE1_PIN_SEL     0

// Pin Mapping for ADC0_SE2 signal
//   <o>    ADC0_SE2<name=ADC0_SE2_PIN_SEL>
//   <i>    Shows which pin ADC0_SE2 is mapped to
//   <info>  [PTC7]
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,ADC0_SE2>
//     <0=> Default
#define ADC0_SE2_PIN_SEL     0

// Pin Mapping for ADC0_SE3 signal
//   <o>    ADC0_SE3<name=ADC0_SE3_PIN_SEL>
//   <i>    Shows which pin ADC0_SE3 is mapped to
//   <info>  [PTD4]
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,ADC0_SE3>
//     <0=> Default
#define ADC0_SE3_PIN_SEL     0

// Pin Mapping for ADC0_SE4 signal
//   <o>    ADC0_SE4<name=ADC0_SE4_PIN_SEL>
//   <i>    Shows which pin ADC0_SE4 is mapped to
//   <info>  [PTD5]
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,ADC0_SE4>
//     <0=> Default
#define ADC0_SE4_PIN_SEL     0

// Pin Mapping for ADC0_SE5 signal
//   <o>    ADC0_SE5<name=ADC0_SE5_PIN_SEL>
//   <i>    Shows which pin ADC0_SE5 is mapped to
//   <info>  [PTD6]
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,ADC0_SE5>
//     <0=> Default
#define ADC0_SE5_PIN_SEL     0

// Pin Mapping for ADC0_SE6 signal
//   <o>    ADC0_SE6<name=ADC0_SE6_PIN_SEL>
//   <i>    Shows which pin ADC0_SE6 is mapped to
//   <info>  [PTE7]
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,ADC0_SE6>
//     <0=> Default
#define ADC0_SE6_PIN_SEL     0

// Pin Mapping for ADC0_SE7 signal
//   <o>    ADC0_SE7<name=ADC0_SE7_PIN_SEL>
//   <i>    Shows which pin ADC0_SE7 is mapped to
//   <info>  [PTF0]
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,ADC0_SE7>
//     <0=> Default
#define ADC0_SE7_PIN_SEL     0

// Pin Mapping for ADC0_SE8 signal
//   <o>    ADC0_SE8<name=ADC0_SE8_PIN_SEL>
//   <i>    Shows which pin ADC0_SE8 is mapped to
//   <info>  [PTF1]
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,LCD0/ADC0_SE8>
//     <0=> Default
#define ADC0_SE8_PIN_SEL     0

// Pin Mapping for ADC0_SE9 signal
//   <o>    ADC0_SE9<name=ADC0_SE9_PIN_SEL>
//   <i>    Shows which pin ADC0_SE9 is mapped to
//   <info>  [PTF2]
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,LCD1/ADC0_SE9>
//     <0=> Default
#define ADC0_SE9_PIN_SEL     0

// Pin Mapping for ADC0_SE10 signal
//   <o>    ADC0_SE10<name=ADC0_SE10_PIN_SEL>
//   <i>    Shows which pin ADC0_SE10 is mapped to
//   <info>  [PTG1]
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,LCD8/ADC0_SE10>
//     <0=> Default
#define ADC0_SE10_PIN_SEL    0

// Pin Mapping for ADC0_SE11 signal
//   <o>    ADC0_SE11<name=ADC0_SE11_PIN_SEL>
//   <i>    Shows which pin ADC0_SE11 is mapped to
//   <info>  [PTG2]
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,LCD9/ADC0_SE11>
//     <0=> Default
#define ADC0_SE11_PIN_SEL    0

// </h>

// <h> Clock and Timing

// Pin Mapping for AFE_CLK signal
//   <o>    AFE_CLK<name=AFE_CLK_PIN_SEL>
//   <i>    Shows which pin AFE_CLK is mapped to
//   <info>  [PTB7, PTE3]
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,AFE_CLK>
//     <2=> PTE3<selection=PTE3_SIG_SEL,AFE_CLK>
//     <0=> Default
#define AFE_CLK_PIN_SEL      0

// Pin Mapping for CLKOUT signal
//   <o>    CLKOUT<name=CLKOUT_PIN_SEL>
//   <i>    Shows which pin CLKOUT is mapped to
//   <info>  [PTF7, PTE0]
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,CLKOUT>
//     <2=> PTE0<selection=PTE0_SIG_SEL,CLKOUT>
//     <0=> Default
#define CLKOUT_PIN_SEL       0

