podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// Pin Mapping for EXTAL1 signal
//   <o>    EXTAL1<name=EXTAL1_PIN_SEL>
//   <i>    Shows which pin EXTAL1 is mapped to
//   <info>  [PTE2]
//     <0=> Disabled
//     <1=> PTE2 (reset default)<selection=PTE2_SIG_SEL,EXTAL1 (reset default)>
//     <2=> PTE2<selection=PTE2_SIG_SEL,EXTAL1>
//     <1=> Default
#define EXTAL1_PIN_SEL       1

// Pin Mapping for EXTAL32K signal
//   <o>    EXTAL32K<name=EXTAL32K_PIN_SEL><constant>
//   <i>    Shows which pin EXTAL32K is mapped to
//   <info>  [EXTAL32K]
//     <0=> EXTAL32K<selection=EXTAL32K_SIG_SEL,EXTAL32K>
//     <0=> Default
#define EXTAL32K_PIN_SEL     0

// Pin Mapping for RTCCLKOUT signal
//   <o>    RTCCLKOUT<name=RTCCLKOUT_PIN_SEL>
//   <i>    Shows which pin RTCCLKOUT is mapped to
//   <info>  [PTF0, PTF2]
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,RTCCLKOUT>
//     <2=> PTF2<selection=PTF2_SIG_SEL,RTCCLKOUT>
//     <0=> Default
#define RTCCLKOUT_PIN_SEL    0

// Pin Mapping for XTAL1 signal
//   <o>    XTAL1<name=XTAL1_PIN_SEL>
//   <i>    Shows which pin XTAL1 is mapped to
//   <info>  [PTE3]
//     <0=> Disabled
//     <1=> PTE3 (reset default)<selection=PTE3_SIG_SEL,XTAL1 (reset default)>
//     <2=> PTE3<selection=PTE3_SIG_SEL,XTAL1>
//     <1=> Default
#define XTAL1_PIN_SEL        1

// Pin Mapping for XTAL32K signal
//   <o>    XTAL32K<name=XTAL32K_PIN_SEL><constant>
//   <i>    Shows which pin XTAL32K is mapped to
//   <info>  [XTAL32K]
//     <0=> XTAL32K<selection=XTAL32K_SIG_SEL,XTAL32K>
//     <0=> Default
#define XTAL32K_PIN_SEL      0

// </h>

// <h> Analogue Comparator (CMP0)

// Pin Mapping for CMP0OUT signal
//   <o>    CMP0OUT<name=CMP0OUT_PIN_SEL>
//   <i>    Shows which pin CMP0OUT is mapped to
//   <info>  [PTA5, PTF0]
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,CMP0OUT>
//     <2=> PTF0<selection=PTF0_SIG_SEL,CMP0OUT>
//     <0=> Default
#define CMP0OUT_PIN_SEL      0

// Pin Mapping for CMP0P0 signal
//   <o>    CMP0P0<name=CMP0P0_PIN_SEL>
//   <i>    Shows which pin CMP0P0 is mapped to
//   <info>  [PTD0]
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,CMP0P0>
//     <0=> Default
#define CMP0P0_PIN_SEL       0

// Pin Mapping for CMP0P1 signal
//   <o>    CMP0P1<name=CMP0P1_PIN_SEL>
//   <i>    Shows which pin CMP0P1 is mapped to
//   <info>  [PTD2]
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,CMP0P1>
//     <0=> Default
#define CMP0P1_PIN_SEL       0

// Pin Mapping for CMP0P2 signal
//   <o>    CMP0P2<name=CMP0P2_PIN_SEL>
//   <i>    Shows which pin CMP0P2 is mapped to
//   <info>  [PTE6]
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,CMP0P2>
//     <0=> Default
#define CMP0P2_PIN_SEL       0

// Pin Mapping for CMP0P3 signal
//   <o>    CMP0P3<name=CMP0P3_PIN_SEL>
//   <i>    Shows which pin CMP0P3 is mapped to
//   <info>  [PTC3]
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LCD42/CMP0P3>
//     <0=> Default
#define CMP0P3_PIN_SEL       0

// Pin Mapping for CMP0P4 signal
//   <o>    CMP0P4<name=CMP0P4_PIN_SEL>
//   <i>    Shows which pin CMP0P4 is mapped to
//   <info>  [PTD7]
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,CMP0P4>
//     <0=> Default
#define CMP0P4_PIN_SEL       0

// Pin Mapping for CMP0P5 signal
//   <o>    CMP0P5<name=CMP0P5_PIN_SEL>
//   <i>    Shows which pin CMP0P5 is mapped to
//   <info>  [PTI0]
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,CMP0P5>
//     <0=> Default
#define CMP0P5_PIN_SEL       0

// </h>

// <h> Analogue Comparator (CMP1)

// Pin Mapping for CMP1OUT signal
//   <o>    CMP1OUT<name=CMP1OUT_PIN_SEL>
//   <i>    Shows which pin CMP1OUT is mapped to
//   <info>  [PTF2, PTD6]
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,CMP1OUT>
//     <2=> PTD6<selection=PTD6_SIG_SEL,CMP1OUT>
//     <0=> Default
#define CMP1OUT_PIN_SEL      0

// Pin Mapping for CMP1P0 signal
//   <o>    CMP1P0<name=CMP1P0_PIN_SEL>
//   <i>    Shows which pin CMP1P0 is mapped to
//   <info>  [PTB6]
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,LCD37/CMP1P0>
//     <0=> Default
#define CMP1P0_PIN_SEL       0

// Pin Mapping for CMP1P1 signal
//   <o>    CMP1P1<name=CMP1P1_PIN_SEL>
//   <i>    Shows which pin CMP1P1 is mapped to
//   <info>  [PTC1]
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,LCD40/CMP1P1>
//     <0=> Default
#define CMP1P1_PIN_SEL       0

// Pin Mapping for CMP1P2 signal
//   <o>    CMP1P2<name=CMP1P2_PIN_SEL><constant>
//   <i>    Shows which pin CMP1P2 is mapped to
//   <info>  [SDADP2]
//     <0=> SDADP2<selection=SDADP2_SIG_SEL,SDADP2/CMP1P2>
//     <0=> Default
#define CMP1P2_PIN_SEL       0

// Pin Mapping for CMP1P3 signal
//   <o>    CMP1P3<name=CMP1P3_PIN_SEL><constant>
//   <i>    Shows which pin CMP1P3 is mapped to
//   <info>  [SDADM2]
//     <0=> SDADM2<selection=SDADM2_SIG_SEL,SDADM2/CMP1P3>
//     <0=> Default
#define CMP1P3_PIN_SEL       0

// Pin Mapping for CMP1P4 signal
//   <o>    CMP1P4<name=CMP1P4_PIN_SEL><constant>
//   <i>    Shows which pin CMP1P4 is mapped to
//   <info>  [SDADP3]
//     <0=> SDADP3<selection=SDADP3_SIG_SEL,SDADP3/CMP1P4>
//     <0=> Default
#define CMP1P4_PIN_SEL       0

// Pin Mapping for CMP1P5 signal
//   <o>    CMP1P5<name=CMP1P5_PIN_SEL><constant>
//   <i>    Shows which pin CMP1P5 is mapped to
//   <info>  [SDADM3]
//     <0=> SDADM3<selection=SDADM3_SIG_SEL,SDADM3/CMP1P5>
//     <0=> Default
#define CMP1P5_PIN_SEL       0

// </h>

// <h> External Watchdog Monitor (EWM)

// Pin Mapping for EWM_IN signal
//   <o>    EWM_IN<name=EWM_IN_PIN_SEL>
//   <i>    Shows which pin EWM_IN is mapped to
//   <info>  [PTE2, PTE4]
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,EWM_IN>
//     <2=> PTE4<selection=PTE4_SIG_SEL,EWM_IN>
//     <0=> Default
#define EWM_IN_PIN_SEL       0

// Pin Mapping for EWM_OUT signal
//   <o>    EWM_OUT<name=EWM_OUT_PIN_SEL>
//   <i>    Shows which pin EWM_OUT is mapped to
//   <info>  [PTE3, PTE5]
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,EWM_OUT>
//     <2=> PTE5<selection=PTE5_SIG_SEL,EWM_OUT>
//     <0=> Default
#define EWM_OUT_PIN_SEL      0

