podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> General Purpose I/O (GPIOD)

// Pin Mapping for GPIOD_0 signal
//   <o>    GPIOD_0<name=GPIOD_0_PIN_SEL>
//   <i>    Shows which pin GPIOD_0 is mapped to
//   <info>  [PTD0]
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,GPIOD_0>
//     <0=> Default
#define GPIOD_0_PIN_SEL      0

// Pin Mapping for GPIOD_1 signal
//   <o>    GPIOD_1<name=GPIOD_1_PIN_SEL>
//   <i>    Shows which pin GPIOD_1 is mapped to
//   <info>  [PTD1]
//     <0=> Disabled
//     <1=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,GPIOD_1>
//     <1=> Default
#define GPIOD_1_PIN_SEL      1

// Pin Mapping for GPIOD_2 signal
//   <o>    GPIOD_2<name=GPIOD_2_PIN_SEL>
//   <i>    Shows which pin GPIOD_2 is mapped to
//   <info>  [PTD2]
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,GPIOD_2>
//     <0=> Default
#define GPIOD_2_PIN_SEL      0

// Pin Mapping for GPIOD_3 signal
//   <o>    GPIOD_3<name=GPIOD_3_PIN_SEL>
//   <i>    Shows which pin GPIOD_3 is mapped to
//   <info>  [PTD3]
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,GPIOD_3>
//     <0=> Default
#define GPIOD_3_PIN_SEL      0

// Pin Mapping for GPIOD_4 signal
//   <o>    GPIOD_4<name=GPIOD_4_PIN_SEL>
//   <i>    Shows which pin GPIOD_4 is mapped to
//   <info>  [PTD4]
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,GPIOD_4>
//     <0=> Default
#define GPIOD_4_PIN_SEL      0

// Pin Mapping for GPIOD_5 signal
//   <o>    GPIOD_5<name=GPIOD_5_PIN_SEL>
//   <i>    Shows which pin GPIOD_5 is mapped to
//   <info>  [PTD5]
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,GPIOD_5>
//     <0=> Default
#define GPIOD_5_PIN_SEL      0

// Pin Mapping for GPIOD_6 signal
//   <o>    GPIOD_6<name=GPIOD_6_PIN_SEL>
//   <i>    Shows which pin GPIOD_6 is mapped to
//   <info>  [PTD6]
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,GPIOD_6>
//     <0=> Default
#define GPIOD_6_PIN_SEL      0

// Pin Mapping for GPIOD_7 signal
//   <o>    GPIOD_7<name=GPIOD_7_PIN_SEL>
//   <i>    Shows which pin GPIOD_7 is mapped to
//   <info>  [PTD7]
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,GPIOD_7>
//     <0=> Default
#define GPIOD_7_PIN_SEL      0

// </h>

// <h> General Purpose I/O (GPIOE)

// Pin Mapping for GPIOE_0 signal
//   <o>    GPIOE_0<name=GPIOE_0_PIN_SEL>
//   <i>    Shows which pin GPIOE_0 is mapped to
//   <info>  [PTE0]
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,GPIOE_0>
//     <0=> Default
#define GPIOE_0_PIN_SEL      0

// Pin Mapping for GPIOE_1 signal
//   <o>    GPIOE_1<name=GPIOE_1_PIN_SEL>
//   <i>    Shows which pin GPIOE_1 is mapped to
//   <info>  [PTE1]
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,GPIOE_1>
//     <0=> Default
#define GPIOE_1_PIN_SEL      0

// Pin Mapping for GPIOE_2 signal
//   <o>    GPIOE_2<name=GPIOE_2_PIN_SEL>
//   <i>    Shows which pin GPIOE_2 is mapped to
//   <info>  [PTE2]
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,GPIOE_2>
//     <0=> Default
#define GPIOE_2_PIN_SEL      0

// Pin Mapping for GPIOE_3 signal
//   <o>    GPIOE_3<name=GPIOE_3_PIN_SEL>
//   <i>    Shows which pin GPIOE_3 is mapped to
//   <info>  [PTE3]
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,GPIOE_3>
//     <0=> Default
#define GPIOE_3_PIN_SEL      0

// Pin Mapping for GPIOE_4 signal
//   <o>    GPIOE_4<name=GPIOE_4_PIN_SEL>
//   <i>    Shows which pin GPIOE_4 is mapped to
//   <info>  [PTE4]
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,GPIOE_4>
//     <0=> Default
#define GPIOE_4_PIN_SEL      0

// Pin Mapping for GPIOE_5 signal
//   <o>    GPIOE_5<name=GPIOE_5_PIN_SEL>
//   <i>    Shows which pin GPIOE_5 is mapped to
//   <info>  [PTE5]
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,GPIOE_5>
//     <0=> Default
#define GPIOE_5_PIN_SEL      0

// Pin Mapping for GPIOE_6 signal
//   <o>    GPIOE_6<name=GPIOE_6_PIN_SEL>
//   <i>    Shows which pin GPIOE_6 is mapped to
//   <info>  [PTE6]
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,GPIOE_6>
//     <0=> Default
#define GPIOE_6_PIN_SEL      0

// Pin Mapping for GPIOE_7 signal
//   <o>    GPIOE_7<name=GPIOE_7_PIN_SEL>
//   <i>    Shows which pin GPIOE_7 is mapped to
//   <info>  [PTE7]
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,GPIOE_7>
//     <0=> Default
#define GPIOE_7_PIN_SEL      0

// </h>

// <h> General Purpose I/O (GPIOF)

// Pin Mapping for GPIOF_0 signal
//   <o>    GPIOF_0<name=GPIOF_0_PIN_SEL>
//   <i>    Shows which pin GPIOF_0 is mapped to
//   <info>  [PTF0]
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,GPIOF_0>
//     <0=> Default
#define GPIOF_0_PIN_SEL      0

// Pin Mapping for GPIOF_1 signal
//   <o>    GPIOF_1<name=GPIOF_1_PIN_SEL>
//   <i>    Shows which pin GPIOF_1 is mapped to
//   <info>  [PTF1]
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,GPIOF_1>
//     <0=> Default
#define GPIOF_1_PIN_SEL      0

// Pin Mapping for GPIOF_2 signal
//   <o>    GPIOF_2<name=GPIOF_2_PIN_SEL>
//   <i>    Shows which pin GPIOF_2 is mapped to
//   <info>  [PTF2]
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,GPIOF_2>
//     <0=> Default
#define GPIOF_2_PIN_SEL      0

// Pin Mapping for GPIOF_3 signal
//   <o>    GPIOF_3<name=GPIOF_3_PIN_SEL>
//   <i>    Shows which pin GPIOF_3 is mapped to
//   <info>  [PTF3]
//     <0=> Disabled
//     <1=> PTF3<selection=PTF3_SIG_SEL,GPIOF_3>
//     <0=> Default
#define GPIOF_3_PIN_SEL      0

// Pin Mapping for GPIOF_4 signal
//   <o>    GPIOF_4<name=GPIOF_4_PIN_SEL>
//   <i>    Shows which pin GPIOF_4 is mapped to
//   <info>  [PTF4]
//     <0=> Disabled
//     <1=> PTF4<selection=PTF4_SIG_SEL,GPIOF_4>
//     <0=> Default
#define GPIOF_4_PIN_SEL      0

// Pin Mapping for GPIOF_5 signal
//   <o>    GPIOF_5<name=GPIOF_5_PIN_SEL>
//   <i>    Shows which pin GPIOF_5 is mapped to
//   <info>  [PTF5]
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,GPIOF_5>
//     <0=> Default
#define GPIOF_5_PIN_SEL      0

// Pin Mapping for GPIOF_6 signal
//   <o>    GPIOF_6<name=GPIOF_6_PIN_SEL>
//   <i>    Shows which pin GPIOF_6 is mapped to
//   <info>  [PTF6]
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,GPIOF_6>
//     <0=> Default
#define GPIOF_6_PIN_SEL      0

// Pin Mapping for GPIOF_7 signal
//   <o>    GPIOF_7<name=GPIOF_7_PIN_SEL>
//   <i>    Shows which pin GPIOF_7 is mapped to
//   <info>  [PTF7]
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,GPIOF_7>
//     <0=> Default
#define GPIOF_7_PIN_SEL      0

