podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> General Purpose I/O (GPIOG)

// Pin Mapping for GPIOG_0 signal
//   <o>    GPIOG_0<name=GPIOG_0_PIN_SEL>
//   <i>    Shows which pin GPIOG_0 is mapped to
//   <info>  [PTG0]
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,GPIOG_0>
//     <0=> Default
#define GPIOG_0_PIN_SEL      0

// Pin Mapping for GPIOG_1 signal
//   <o>    GPIOG_1<name=GPIOG_1_PIN_SEL>
//   <i>    Shows which pin GPIOG_1 is mapped to
//   <info>  [PTG1]
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,GPIOG_1>
//     <0=> Default
#define GPIOG_1_PIN_SEL      0

// Pin Mapping for GPIOG_2 signal
//   <o>    GPIOG_2<name=GPIOG_2_PIN_SEL>
//   <i>    Shows which pin GPIOG_2 is mapped to
//   <info>  [PTG2]
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,GPIOG_2>
//     <0=> Default
#define GPIOG_2_PIN_SEL      0

// Pin Mapping for GPIOG_3 signal
//   <o>    GPIOG_3<name=GPIOG_3_PIN_SEL>
//   <i>    Shows which pin GPIOG_3 is mapped to
//   <info>  [PTG3]
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,GPIOG_3>
//     <0=> Default
#define GPIOG_3_PIN_SEL      0

// Pin Mapping for GPIOG_4 signal
//   <o>    GPIOG_4<name=GPIOG_4_PIN_SEL>
//   <i>    Shows which pin GPIOG_4 is mapped to
//   <info>  [PTG4]
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,GPIOG_4>
//     <0=> Default
#define GPIOG_4_PIN_SEL      0

// Pin Mapping for GPIOG_5 signal
//   <o>    GPIOG_5<name=GPIOG_5_PIN_SEL>
//   <i>    Shows which pin GPIOG_5 is mapped to
//   <info>  [PTG5]
//     <0=> Disabled
//     <1=> PTG5<selection=PTG5_SIG_SEL,GPIOG_5>
//     <0=> Default
#define GPIOG_5_PIN_SEL      0

// Pin Mapping for GPIOG_6 signal
//   <o>    GPIOG_6<name=GPIOG_6_PIN_SEL>
//   <i>    Shows which pin GPIOG_6 is mapped to
//   <info>  [PTG6]
//     <0=> Disabled
//     <1=> PTG6<selection=PTG6_SIG_SEL,GPIOG_6>
//     <0=> Default
#define GPIOG_6_PIN_SEL      0

// Pin Mapping for GPIOG_7 signal
//   <o>    GPIOG_7<name=GPIOG_7_PIN_SEL>
//   <i>    Shows which pin GPIOG_7 is mapped to
//   <info>  [PTG7]
//     <0=> Disabled
//     <1=> PTG7<selection=PTG7_SIG_SEL,GPIOG_7>
//     <0=> Default
#define GPIOG_7_PIN_SEL      0

// </h>

// <h> General Purpose I/O (GPIOH)

// Pin Mapping for GPIOH_0 signal
//   <o>    GPIOH_0<name=GPIOH_0_PIN_SEL>
//   <i>    Shows which pin GPIOH_0 is mapped to
//   <info>  [PTH0]
//     <0=> Disabled
//     <1=> PTH0<selection=PTH0_SIG_SEL,GPIOH_0>
//     <0=> Default
#define GPIOH_0_PIN_SEL      0

// Pin Mapping for GPIOH_1 signal
//   <o>    GPIOH_1<name=GPIOH_1_PIN_SEL>
//   <i>    Shows which pin GPIOH_1 is mapped to
//   <info>  [PTH1]
//     <0=> Disabled
//     <1=> PTH1<selection=PTH1_SIG_SEL,GPIOH_1>
//     <0=> Default
#define GPIOH_1_PIN_SEL      0

// Pin Mapping for GPIOH_2 signal
//   <o>    GPIOH_2<name=GPIOH_2_PIN_SEL>
//   <i>    Shows which pin GPIOH_2 is mapped to
//   <info>  [PTH2]
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,GPIOH_2>
//     <0=> Default
#define GPIOH_2_PIN_SEL      0

// Pin Mapping for GPIOH_3 signal
//   <o>    GPIOH_3<name=GPIOH_3_PIN_SEL>
//   <i>    Shows which pin GPIOH_3 is mapped to
//   <info>  [PTH3]
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,GPIOH_3>
//     <0=> Default
#define GPIOH_3_PIN_SEL      0

// Pin Mapping for GPIOH_4 signal
//   <o>    GPIOH_4<name=GPIOH_4_PIN_SEL>
//   <i>    Shows which pin GPIOH_4 is mapped to
//   <info>  [PTH4]
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,GPIOH_4>
//     <0=> Default
#define GPIOH_4_PIN_SEL      0

// Pin Mapping for GPIOH_5 signal
//   <o>    GPIOH_5<name=GPIOH_5_PIN_SEL>
//   <i>    Shows which pin GPIOH_5 is mapped to
//   <info>  [PTH5]
//     <0=> Disabled
//     <1=> PTH5<selection=PTH5_SIG_SEL,GPIOH_5>
//     <0=> Default
#define GPIOH_5_PIN_SEL      0

// Pin Mapping for GPIOH_6 signal
//   <o>    GPIOH_6<name=GPIOH_6_PIN_SEL>
//   <i>    Shows which pin GPIOH_6 is mapped to
//   <info>  [PTH6]
//     <0=> Disabled
//     <1=> PTH6<selection=PTH6_SIG_SEL,GPIOH_6>
//     <0=> Default
#define GPIOH_6_PIN_SEL      0

// Pin Mapping for GPIOH_7 signal
//   <o>    GPIOH_7<name=GPIOH_7_PIN_SEL>
//   <i>    Shows which pin GPIOH_7 is mapped to
//   <info>  [PTH7]
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,GPIOH_7>
//     <0=> Default
#define GPIOH_7_PIN_SEL      0

// </h>

// <h> General Purpose I/O (GPIOI)

// Pin Mapping for GPIOI_0 signal
//   <o>    GPIOI_0<name=GPIOI_0_PIN_SEL>
//   <i>    Shows which pin GPIOI_0 is mapped to
//   <info>  [PTI0]
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,GPIOI_0>
//     <0=> Default
#define GPIOI_0_PIN_SEL      0

// Pin Mapping for GPIOI_1 signal
//   <o>    GPIOI_1<name=GPIOI_1_PIN_SEL>
//   <i>    Shows which pin GPIOI_1 is mapped to
//   <info>  [PTI1]
//     <0=> Disabled
//     <1=> PTI1<selection=PTI1_SIG_SEL,GPIOI_1>
//     <0=> Default
#define GPIOI_1_PIN_SEL      0

// Pin Mapping for GPIOI_2 signal
//   <o>    GPIOI_2<name=GPIOI_2_PIN_SEL>
//   <i>    Shows which pin GPIOI_2 is mapped to
//   <info>  [PTI2]
//     <0=> Disabled
//     <1=> PTI2<selection=PTI2_SIG_SEL,GPIOI_2>
//     <0=> Default
#define GPIOI_2_PIN_SEL      0

// Pin Mapping for GPIOI_3 signal
//   <o>    GPIOI_3<name=GPIOI_3_PIN_SEL>
//   <i>    Shows which pin GPIOI_3 is mapped to
//   <info>  [PTI3]
//     <0=> Disabled
//     <1=> PTI3<selection=PTI3_SIG_SEL,GPIOI_3>
//     <0=> Default
#define GPIOI_3_PIN_SEL      0

// </h>

// <h> Inter-Integrated Circuit (I2C0)

// Pin Mapping for I2C0_SCL signal
//   <o>    I2C0_SCL<name=I2C0_SCL_PIN_SEL>
//   <i>    Shows which pin I2C0_SCL is mapped to
//   <info>  [PTD7, PTG3, PTE6]
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,I2C0_SCL>
//     <2=> PTG3<selection=PTG3_SIG_SEL,I2C0_SCL>
//     <3=> PTE6<selection=PTE6_SIG_SEL,I2C0_SCL>
//     <0=> Default
#define I2C0_SCL_PIN_SEL     0

// Pin Mapping for I2C0_SDA signal
//   <o>    I2C0_SDA<name=I2C0_SDA_PIN_SEL>
//   <i>    Shows which pin I2C0_SDA is mapped to
//   <info>  [PTE0, PTG4, PTE7]
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,I2C0_SDA>
//     <2=> PTG4<selection=PTG4_SIG_SEL,I2C0_SDA>
//     <3=> PTE7<selection=PTE7_SIG_SEL,I2C0_SDA>
//     <0=> Default
#define I2C0_SDA_PIN_SEL     0

