podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> Inter-Integrated Circuit (I2C1)

// Pin Mapping for I2C1_SDA signal
//   <o>    I2C1_SDA<name=I2C1_SDA_PIN_SEL>
//   <i>    Shows which pin I2C1_SDA is mapped to
//   <info>  [PTF6, PTE2]
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,I2C1_SDA>
//     <2=> PTE2<selection=PTE2_SIG_SEL,I2C1_SDA>
//     <0=> Default
#define I2C1_SDA_PIN_SEL     0

// Pin Mapping for I2C1_SCL signal
//   <o>    I2C1_SCL<name=I2C1_SCL_PIN_SEL>
//   <i>    Shows which pin I2C1_SCL is mapped to
//   <info>  [PTF5, PTE3]
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,I2C1_SCL>
//     <2=> PTE3<selection=PTE3_SIG_SEL,I2C1_SCL>
//     <0=> Default
#define I2C1_SCL_PIN_SEL     0

// </h>

// <h> Low-Leakage Wake-up Unit (LLWU)

// Pin Mapping for LLWU_P0 signal
//   <o>    LLWU_P0<name=LLWU_P0_PIN_SEL>
//   <i>    Shows which pin LLWU_P0 is mapped to
//   <info>  [PTG6]
//     <0=> Disabled
//     <1=> PTG6<selection=PTG6_SIG_SEL,LLWU_P0>
//     <0=> Default
#define LLWU_P0_PIN_SEL      0

// Pin Mapping for LLWU_P1 signal
//   <o>    LLWU_P1<name=LLWU_P1_PIN_SEL>
//   <i>    Shows which pin LLWU_P1 is mapped to
//   <info>  [PTG2]
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,LLWU_P1>
//     <0=> Default
#define LLWU_P1_PIN_SEL      0

// Pin Mapping for LLWU_P2 signal
//   <o>    LLWU_P2<name=LLWU_P2_PIN_SEL>
//   <i>    Shows which pin LLWU_P2 is mapped to
//   <info>  [PTG1]
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,LLWU_P2>
//     <0=> Default
#define LLWU_P2_PIN_SEL      0

// Pin Mapping for LLWU_P3 signal
//   <o>    LLWU_P3<name=LLWU_P3_PIN_SEL>
//   <i>    Shows which pin LLWU_P3 is mapped to
//   <info>  [PTF6]
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,LLWU_P3>
//     <0=> Default
#define LLWU_P3_PIN_SEL      0

// Pin Mapping for LLWU_P4 signal
//   <o>    LLWU_P4<name=LLWU_P4_PIN_SEL>
//   <i>    Shows which pin LLWU_P4 is mapped to
//   <info>  [PTF0]
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,LLWU_P4>
//     <0=> Default
#define LLWU_P4_PIN_SEL      0

// Pin Mapping for LLWU_P5 signal
//   <o>    LLWU_P5<name=LLWU_P5_PIN_SEL>
//   <i>    Shows which pin LLWU_P5 is mapped to
//   <info>  [PTE6]
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,LLWU_P5>
//     <0=> Default
#define LLWU_P5_PIN_SEL      0

// Pin Mapping for LLWU_P6 signal
//   <o>    LLWU_P6<name=LLWU_P6_PIN_SEL>
//   <i>    Shows which pin LLWU_P6 is mapped to
//   <info>  [PTE5]
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,LLWU_P6>
//     <0=> Default
#define LLWU_P6_PIN_SEL      0

// Pin Mapping for LLWU_P7 signal
//   <o>    LLWU_P7<name=LLWU_P7_PIN_SEL>
//   <i>    Shows which pin LLWU_P7 is mapped to
//   <info>  [PTD7]
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,LLWU_P7>
//     <0=> Default
#define LLWU_P7_PIN_SEL      0

// Pin Mapping for LLWU_P8 signal
//   <o>    LLWU_P8<name=LLWU_P8_PIN_SEL>
//   <i>    Shows which pin LLWU_P8 is mapped to
//   <info>  [PTD6]
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,LLWU_P8>
//     <0=> Default
#define LLWU_P8_PIN_SEL      0

// Pin Mapping for LLWU_P9 signal
//   <o>    LLWU_P9<name=LLWU_P9_PIN_SEL>
//   <i>    Shows which pin LLWU_P9 is mapped to
//   <info>  [PTD4]
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,LLWU_P9>
//     <0=> Default
#define LLWU_P9_PIN_SEL      0

// Pin Mapping for LLWU_P10 signal
//   <o>    LLWU_P10<name=LLWU_P10_PIN_SEL>
//   <i>    Shows which pin LLWU_P10 is mapped to
//   <info>  [PTD2]
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,LLWU_P10>
//     <0=> Default
#define LLWU_P10_PIN_SEL     0

// Pin Mapping for LLWU_P11 signal
//   <o>    LLWU_P11<name=LLWU_P11_PIN_SEL>
//   <i>    Shows which pin LLWU_P11 is mapped to
//   <info>  [PTD0]
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,LLWU_P11>
//     <0=> Default
#define LLWU_P11_PIN_SEL     0

// Pin Mapping for LLWU_P12 signal
//   <o>    LLWU_P12<name=LLWU_P12_PIN_SEL>
//   <i>    Shows which pin LLWU_P12 is mapped to
//   <info>  [PTC5]
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,LLWU_P12>
//     <0=> Default
#define LLWU_P12_PIN_SEL     0

// Pin Mapping for LLWU_P13 signal
//   <o>    LLWU_P13<name=LLWU_P13_PIN_SEL>
//   <i>    Shows which pin LLWU_P13 is mapped to
//   <info>  [PTC3]
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LLWU_P13>
//     <0=> Default
#define LLWU_P13_PIN_SEL     0

// Pin Mapping for LLWU_P14 signal
//   <o>    LLWU_P14<name=LLWU_P14_PIN_SEL>
//   <i>    Shows which pin LLWU_P14 is mapped to
//   <info>  [PTA6]
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,LLWU_P14>
//     <0=> Default
#define LLWU_P14_PIN_SEL     0

// Pin Mapping for LLWU_P15 signal
//   <o>    LLWU_P15<name=LLWU_P15_PIN_SEL>
//   <i>    Shows which pin LLWU_P15 is mapped to
//   <info>  [PTA4]
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,LLWU_P15>
//     <0=> Default
#define LLWU_P15_PIN_SEL     0

// </h>

// <h> Low Power Timer (LPTMR)

// Pin Mapping for LPTMR_ALT0 signal
//   <o>    LPTMR_ALT0<name=LPTMR_ALT0_PIN_SEL>
//   <i>    Shows which pin LPTMR_ALT0 is mapped to
//   <info>  [PTE4, PTF4, PTG1]
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,LPTMR_ALT0>
//     <2=> PTF4<selection=PTF4_SIG_SEL,LPTMR_ALT0>
//     <3=> PTG1<selection=PTG1_SIG_SEL,LPTMR_ALT0>
//     <0=> Default
#define LPTMR_ALT0_PIN_SEL   0

// Pin Mapping for LPTMR_ALT1 signal
//   <o>    LPTMR_ALT1<name=LPTMR_ALT1_PIN_SEL>
//   <i>    Shows which pin LPTMR_ALT1 is mapped to
//   <info>  [PTD6, PTF3, PTG5]
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,LPTMR_ALT1>
//     <2=> PTF3<selection=PTF3_SIG_SEL,LPTMR_ALT1>
//     <3=> PTG5<selection=PTG5_SIG_SEL,LPTMR_ALT1>
//     <0=> Default
#define LPTMR_ALT1_PIN_SEL   0

// Pin Mapping for LPTMR_ALT2 signal
//   <o>    LPTMR_ALT2<name=LPTMR_ALT2_PIN_SEL>
//   <i>    Shows which pin LPTMR_ALT2 is mapped to
//   <info>  [PTD5, PTG0, PTG6]
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,LPTMR_ALT2>
//     <2=> PTG0<selection=PTG0_SIG_SEL,LPTMR_ALT2>
//     <3=> PTG6<selection=PTG6_SIG_SEL,LPTMR_ALT2>
//     <0=> Default
#define LPTMR_ALT2_PIN_SEL   0

