podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> Debug and Control

// Pin Mapping for NMI_B signal
//   <o>    NMI_B<name=NMI_B_PIN_SEL>
//   <i>    Shows which pin NMI_B is mapped to
//   <info>  [PTA4]
//     <0=> Disabled
//     <1=> PTA4 (reset default)<selection=PTA4_SIG_SEL,NMI_B (reset default)>
//     <2=> PTA4<selection=PTA4_SIG_SEL,NMI_B>
//     <1=> Default
#define NMI_B_PIN_SEL        1

// Pin Mapping for RESET_B signal
//   <o>    RESET_B<name=RESET_B_PIN_SEL>
//   <i>    Shows which pin RESET_B is mapped to
//   <info>  [PTE1]
//     <0=> Disabled
//     <1=> PTE1 (reset default)<selection=PTE1_SIG_SEL,RESET_B (reset default)>
//     <2=> PTE1<selection=PTE1_SIG_SEL,RESET_B>
//     <1=> Default
#define RESET_B_PIN_SEL      1

// Pin Mapping for SWD_CLK signal
//   <o>    SWD_CLK<name=SWD_CLK_PIN_SEL>
//   <i>    Shows which pin SWD_CLK is mapped to
//   <info>  [PTE7]
//     <0=> Disabled
//     <1=> PTE7 (reset default)<selection=PTE7_SIG_SEL,SWD_CLK (reset default)>
//     <2=> PTE7<selection=PTE7_SIG_SEL,SWD_CLK>
//     <1=> Default
#define SWD_CLK_PIN_SEL      1

// Pin Mapping for SWD_IO signal
//   <o>    SWD_IO<name=SWD_IO_PIN_SEL>
//   <i>    Shows which pin SWD_IO is mapped to
//   <info>  [PTE6]
//     <0=> Disabled
//     <1=> PTE6 (reset default)<selection=PTE6_SIG_SEL,SWD_IO (reset default)>
//     <2=> PTE6<selection=PTE6_SIG_SEL,SWD_IO>
//     <1=> Default
#define SWD_IO_PIN_SEL       1

// </h>

// <h> (PXBAR)

// Pin Mapping for PXBAR_IN0 signal
//   <o>    PXBAR_IN0<name=PXBAR_IN0_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN0 is mapped to
//   <info>  [PTA6]
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,PXBAR_IN0>
//     <0=> Default
#define PXBAR_IN0_PIN_SEL    0

// Pin Mapping for PXBAR_IN1 signal
//   <o>    PXBAR_IN1<name=PXBAR_IN1_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN1 is mapped to
//   <info>  [PTC0]
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,PXBAR_IN1>
//     <0=> Default
#define PXBAR_IN1_PIN_SEL    0

// Pin Mapping for PXBAR_IN2 signal
//   <o>    PXBAR_IN2<name=PXBAR_IN2_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN2 is mapped to
//   <info>  [PTD0]
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,PXBAR_IN2>
//     <0=> Default
#define PXBAR_IN2_PIN_SEL    0

// Pin Mapping for PXBAR_IN3 signal
//   <o>    PXBAR_IN3<name=PXBAR_IN3_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN3 is mapped to
//   <info>  [PTD2]
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,PXBAR_IN3>
//     <0=> Default
#define PXBAR_IN3_PIN_SEL    0

// Pin Mapping for PXBAR_IN4 signal
//   <o>    PXBAR_IN4<name=PXBAR_IN4_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN4 is mapped to
//   <info>  [PTD7]
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,PXBAR_IN4>
//     <0=> Default
#define PXBAR_IN4_PIN_SEL    0

// Pin Mapping for PXBAR_IN5 signal
//   <o>    PXBAR_IN5<name=PXBAR_IN5_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN5 is mapped to
//   <info>  [PTE6]
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,PXBAR_IN5>
//     <0=> Default
#define PXBAR_IN5_PIN_SEL    0

// Pin Mapping for PXBAR_IN6 signal
//   <o>    PXBAR_IN6<name=PXBAR_IN6_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN6 is mapped to
//   <info>  [PTE2]
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,PXBAR_IN6>
//     <0=> Default
#define PXBAR_IN6_PIN_SEL    0

// Pin Mapping for PXBAR_IN7 signal
//   <o>    PXBAR_IN7<name=PXBAR_IN7_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN7 is mapped to
//   <info>  [PTH6]
//     <0=> Disabled
//     <1=> PTH6<selection=PTH6_SIG_SEL,PXBAR_IN7>
//     <0=> Default
#define PXBAR_IN7_PIN_SEL    0

// Pin Mapping for PXBAR_IN8 signal
//   <o>    PXBAR_IN8<name=PXBAR_IN8_PIN_SEL>
//   <i>    Shows which pin PXBAR_IN8 is mapped to
//   <info>  [PTI0]
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,PXBAR_IN8>
//     <0=> Default
#define PXBAR_IN8_PIN_SEL    0

// Pin Mapping for PXBAR_OUT0 signal
//   <o>    PXBAR_OUT0<name=PXBAR_OUT0_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT0 is mapped to
//   <info>  [PTA7]
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,PXBAR_OUT0>
//     <0=> Default
#define PXBAR_OUT0_PIN_SEL   0

// Pin Mapping for PXBAR_OUT1 signal
//   <o>    PXBAR_OUT1<name=PXBAR_OUT1_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT1 is mapped to
//   <info>  [PTC2]
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,PXBAR_OUT1>
//     <0=> Default
#define PXBAR_OUT1_PIN_SEL   0

// Pin Mapping for PXBAR_OUT2 signal
//   <o>    PXBAR_OUT2<name=PXBAR_OUT2_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT2 is mapped to
//   <info>  [PTC7]
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,PXBAR_OUT2>
//     <0=> Default
#define PXBAR_OUT2_PIN_SEL   0

// Pin Mapping for PXBAR_OUT3 signal
//   <o>    PXBAR_OUT3<name=PXBAR_OUT3_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT3 is mapped to
//   <info>  [PTD1]
//     <0=> Disabled
//     <1=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,PXBAR_OUT3>
//     <0=> Default
#define PXBAR_OUT3_PIN_SEL   0

// Pin Mapping for PXBAR_OUT4 signal
//   <o>    PXBAR_OUT4<name=PXBAR_OUT4_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT4 is mapped to
//   <info>  [PTE0]
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,PXBAR_OUT4>
//     <0=> Default
#define PXBAR_OUT4_PIN_SEL   0

// Pin Mapping for PXBAR_OUT5 signal
//   <o>    PXBAR_OUT5<name=PXBAR_OUT5_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT5 is mapped to
//   <info>  [PTE7]
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,PXBAR_OUT5>
//     <0=> Default
#define PXBAR_OUT5_PIN_SEL   0

// Pin Mapping for PXBAR_OUT6 signal
//   <o>    PXBAR_OUT6<name=PXBAR_OUT6_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT6 is mapped to
//   <info>  [PTF1]
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,PXBAR_OUT6>
//     <0=> Default
#define PXBAR_OUT6_PIN_SEL   0

// Pin Mapping for PXBAR_OUT7 signal
//   <o>    PXBAR_OUT7<name=PXBAR_OUT7_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT7 is mapped to
//   <info>  [PTH7]
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,PXBAR_OUT7>
//     <0=> Default
#define PXBAR_OUT7_PIN_SEL   0

// Pin Mapping for PXBAR_OUT8 signal
//   <o>    PXBAR_OUT8<name=PXBAR_OUT8_PIN_SEL>
//   <i>    Shows which pin PXBAR_OUT8 is mapped to
//   <info>  [PTI1]
//     <0=> Disabled
//     <1=> PTI1<selection=PTI1_SIG_SEL,PXBAR_OUT8>
//     <0=> Default
#define PXBAR_OUT8_PIN_SEL   0

