podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
// </h>

// <h> (QT)

// Pin Mapping for QT0 signal
//   <o>    QT0<name=QT0_PIN_SEL>
//   <i>    Shows which pin QT0 is mapped to
//   <info>  [PTF1, PTD5]
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,QT0>
//     <2=> PTD5<selection=PTD5_SIG_SEL,QT0>
//     <0=> Default
#define QT0_PIN_SEL          0

// Pin Mapping for QT1 signal
//   <o>    QT1<name=QT1_PIN_SEL>
//   <i>    Shows which pin QT1 is mapped to
//   <info>  [PTG0, PTC6]
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,QT1>
//     <2=> PTC6<selection=PTC6_SIG_SEL,QT1>
//     <0=> Default
#define QT1_PIN_SEL          0

// Pin Mapping for QT2 signal
//   <o>    QT2<name=QT2_PIN_SEL>
//   <i>    Shows which pin QT2 is mapped to
//   <info>  [PTF7, PTF0]
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,QT2>
//     <2=> PTF0<selection=PTF0_SIG_SEL,QT2>
//     <0=> Default
#define QT2_PIN_SEL          0

// Pin Mapping for QT3 signal
//   <o>    QT3<name=QT3_PIN_SEL>
//   <i>    Shows which pin QT3 is mapped to
//   <info>  [PTE5, PTD1]
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,QT3>
//     <2=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,QT3>
//     <0=> Default
#define QT3_PIN_SEL          0

// </h>

// <h> Serial Communication Interface (SCI0)

// Pin Mapping for SCI0_CTS signal
//   <o>    SCI0_CTS<name=SCI0_CTS_PIN_SEL>
//   <i>    Shows which pin SCI0_CTS is mapped to
//   <info>  [PTC6]
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,SCI0_CTS>
//     <0=> Default
#define SCI0_CTS_PIN_SEL     0

// Pin Mapping for SCI0_RTS signal
//   <o>    SCI0_RTS<name=SCI0_RTS_PIN_SEL>
//   <i>    Shows which pin SCI0_RTS is mapped to
//   <info>  [PTC5]
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,SCI0_RTS>
//     <0=> Default
#define SCI0_RTS_PIN_SEL     0

// Pin Mapping for SCI0_RxD signal
//   <o>    SCI0_RxD<name=SCI0_RxD_PIN_SEL>
//   <i>    Shows which pin SCI0_RxD is mapped to
//   <info>  [PTD0, PTF3]
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,SCI0_RxD>
//     <2=> PTF3<selection=PTF3_SIG_SEL,SCI0_RxD>
//     <0=> Default
#define SCI0_RxD_PIN_SEL     0

// Pin Mapping for SCI0_TxD signal
//   <o>    SCI0_TxD<name=SCI0_TxD_PIN_SEL>
//   <i>    Shows which pin SCI0_TxD is mapped to
//   <info>  [PTC7, PTF4]
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,SCI0_TxD>
//     <2=> PTF4<selection=PTF4_SIG_SEL,SCI0_TxD>
//     <0=> Default
#define SCI0_TxD_PIN_SEL     0

// </h>

// <h> Serial Communication Interface (SCI1)

// Pin Mapping for SCI1_CTS signal
//   <o>    SCI1_CTS<name=SCI1_CTS_PIN_SEL>
//   <i>    Shows which pin SCI1_CTS is mapped to
//   <info>  [PTD3, PTH6]
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,SCI1_CTS>
//     <2=> PTH6<selection=PTH6_SIG_SEL,SCI1_CTS>
//     <0=> Default
#define SCI1_CTS_PIN_SEL     0

// Pin Mapping for SCI1_RTS signal
//   <o>    SCI1_RTS<name=SCI1_RTS_PIN_SEL>
//   <i>    Shows which pin SCI1_RTS is mapped to
//   <info>  [PTD4, PTH7]
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,SCI1_RTS>
//     <2=> PTH7<selection=PTH7_SIG_SEL,SCI1_RTS>
//     <0=> Default
#define SCI1_RTS_PIN_SEL     0

// Pin Mapping for SCI1_RxD signal
//   <o>    SCI1_RxD<name=SCI1_RxD_PIN_SEL>
//   <i>    Shows which pin SCI1_RxD is mapped to
//   <info>  [PTD2, PTI0]
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,SCI1_RxD>
//     <2=> PTI0<selection=PTI0_SIG_SEL,SCI1_RxD>
//     <0=> Default
#define SCI1_RxD_PIN_SEL     0

// Pin Mapping for SCI1_TxD signal
//   <o>    SCI1_TxD<name=SCI1_TxD_PIN_SEL>
//   <i>    Shows which pin SCI1_TxD is mapped to
//   <info>  [PTD1, PTI1]
//     <0=> Disabled
//     <1=> PTD1 (Alias:LED_BLUE)<selection=PTD1_SIG_SEL,SCI1_TxD>
//     <2=> PTI1<selection=PTI1_SIG_SEL,SCI1_TxD>
//     <0=> Default
#define SCI1_TxD_PIN_SEL     0

// </h>

// <h> Serial Communication Interface (SCI2)

// Pin Mapping for SCI2_CTS signal
//   <o>    SCI2_CTS<name=SCI2_CTS_PIN_SEL>
//   <i>    Shows which pin SCI2_CTS is mapped to
//   <info>  [PTE4]
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,SCI2_CTS>
//     <0=> Default
#define SCI2_CTS_PIN_SEL     0

// Pin Mapping for SCI2_RTS signal
//   <o>    SCI2_RTS<name=SCI2_RTS_PIN_SEL>
//   <i>    Shows which pin SCI2_RTS is mapped to
//   <info>  [PTE5]
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,SCI2_RTS>
//     <0=> Default
#define SCI2_RTS_PIN_SEL     0

// Pin Mapping for SCI2_RxD signal
//   <o>    SCI2_RxD<name=SCI2_RxD_PIN_SEL>
//   <i>    Shows which pin SCI2_RxD is mapped to
//   <info>  [PTE6]
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,SCI2_RxD>
//     <0=> Default
#define SCI2_RxD_PIN_SEL     0

// Pin Mapping for SCI2_TxD signal
//   <o>    SCI2_TxD<name=SCI2_TxD_PIN_SEL>
//   <i>    Shows which pin SCI2_TxD is mapped to
//   <info>  [PTE7]
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,SCI2_TxD>
//     <0=> Default
#define SCI2_TxD_PIN_SEL     0

// </h>

// <h> Serial Communication Interface (SCI3)

// Pin Mapping for SCI3_CTS signal
//   <o>    SCI3_CTS<name=SCI3_CTS_PIN_SEL>
//   <i>    Shows which pin SCI3_CTS is mapped to
//   <info>  [PTC1, PTD5]
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,SCI3_CTS>
//     <2=> PTD5<selection=PTD5_SIG_SEL,SCI3_CTS>
//     <0=> Default
#define SCI3_CTS_PIN_SEL     0

// Pin Mapping for SCI3_RTS signal
//   <o>    SCI3_RTS<name=SCI3_RTS_PIN_SEL>
//   <i>    Shows which pin SCI3_RTS is mapped to
//   <info>  [PTC0, PTD6]
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,SCI3_RTS>
//     <2=> PTD6<selection=PTD6_SIG_SEL,SCI3_RTS>
//     <0=> Default
#define SCI3_RTS_PIN_SEL     0

// Pin Mapping for SCI3_RxD signal
//   <o>    SCI3_RxD<name=SCI3_RxD_PIN_SEL>
//   <i>    Shows which pin SCI3_RxD is mapped to
//   <info>  [PTC3, PTD7]
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,SCI3_RxD>
//     <2=> PTD7<selection=PTD7_SIG_SEL,SCI3_RxD>
//     <0=> Default
#define SCI3_RxD_PIN_SEL     0

// Pin Mapping for SCI3_TxD signal
//   <o>    SCI3_TxD<name=SCI3_TxD_PIN_SEL>
//   <i>    Shows which pin SCI3_TxD is mapped to
//   <info>  [PTC2, PTE0]
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,SCI3_TxD>
//     <2=> PTE0<selection=PTE0_SIG_SEL,SCI3_TxD>
//     <0=> Default
#define SCI3_TxD_PIN_SEL     0

