podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKM33Z5-Demo.h
         //          clockMask         pcrAddress      gpioAddress gpioBit muxValue
#if (LLWU_P0_PIN_SEL == 1)
         /*  0 */  { PORTG_CLOCK_MASK, PORTG_BasePtr,  GPIOG_BasePtr,  6,  2 },
#else
         /*  0 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P1_PIN_SEL == 1)
         /*  1 */  { PORTG_CLOCK_MASK, PORTG_BasePtr,  GPIOG_BasePtr,  2,  3 },
#else
         /*  1 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P2_PIN_SEL == 1)
         /*  2 */  { PORTG_CLOCK_MASK, PORTG_BasePtr,  GPIOG_BasePtr,  1,  2 },
#else
         /*  2 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P3_PIN_SEL == 1)
         /*  3 */  { PORTF_CLOCK_MASK, PORTF_BasePtr,  GPIOF_BasePtr,  6,  4 },
#else
         /*  3 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P4_PIN_SEL == 1)
         /*  4 */  { PORTF_CLOCK_MASK, PORTF_BasePtr,  GPIOF_BasePtr,  0,  5 },
#else
         /*  4 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P5_PIN_SEL == 1)
         /*  5 */  { PORTE_CLOCK_MASK, PORTE_BasePtr,  GPIOE_BasePtr,  6,  4 },
#else
         /*  5 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P6_PIN_SEL == 1)
         /*  6 */  { PORTE_CLOCK_MASK, PORTE_BasePtr,  GPIOE_BasePtr,  5,  5 },
#else
         /*  6 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P7_PIN_SEL == 1)
         /*  7 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  7,  5 },
#else
         /*  7 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P8_PIN_SEL == 1)
         /*  8 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  6,  5 },
#else
         /*  8 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P9_PIN_SEL == 1)
         /*  9 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  4,  4 },
#else
         /*  9 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P10_PIN_SEL == 1)
         /* 10 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  2,  5 },
#else
         /* 10 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P11_PIN_SEL == 1)
         /* 11 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  0,  4 },
#else
         /* 11 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P12_PIN_SEL == 1)
         /* 12 */  { PORTC_CLOCK_MASK, PORTC_BasePtr,  GPIOC_BasePtr,  5,  3 },
#else
         /* 12 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P13_PIN_SEL == 1)
         /* 13 */  { PORTC_CLOCK_MASK, PORTC_BasePtr,  GPIOC_BasePtr,  3,  3 },
#else
         /* 13 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P14_PIN_SEL == 1)
         /* 14 */  { PORTA_CLOCK_MASK, PORTA_BasePtr,  GPIOA_BasePtr,  6,  3 },
#else
         /* 14 */  { 0, 0, 0, 0, 0 },
#endif
#if (LLWU_P15_PIN_SEL == 1)
         /* 15 */  { PORTA_CLOCK_MASK, PORTA_BasePtr,  GPIOA_BasePtr,  4,  2 },
#else
         /* 15 */  { 0, 0, 0, 0, 0 },
#endif
   };
};

/**
 * Peripheral information for SPI, Serial Peripheral Interface
 */
class Spi0Info {
public:
   //! Hardware base pointer
   static constexpr uint32_t basePtr   = SPI0_BasePtr;

   //! Base value for PCR (excluding MUX value)
   static constexpr uint32_t pcrValue  = DEFAULT_PCR;

   //! Clock mask for peripheral
   static constexpr uint32_t clockMask = SIM_SCGC4_SPI0_MASK;

   //! Address of clock register for peripheral
   static constexpr uint32_t clockReg  = SIM_BasePtr+offsetof(SIM_Type,SCGC4);

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = 0;

   //! Information for each pin of peripheral
   static constexpr PcrInfo  info[32] = {

         //          clockMask         pcrAddress      gpioAddress gpioBit muxValue
#if (SPI0_SCK_PIN_SEL == 1)
         /*  0 */  { PORTG_CLOCK_MASK, PORTG_BasePtr,  GPIOG_BasePtr,  3,  2 },
#elif (SPI0_SCK_PIN_SEL == 2)
         /*  0 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  2,  3 },
#else
         /*  0 */  { 0, 0, 0, 0, 0 },
#endif
#if (SPI0_MISO_PIN_SEL == 1)
         /*  1 */  { PORTG_CLOCK_MASK, PORTG_BasePtr,  GPIOG_BasePtr,  5,  2 },
#elif (SPI0_MISO_PIN_SEL == 2)
         /*  1 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  4,  3 },
#else
         /*  1 */  { 0, 0, 0, 0, 0 },
#endif
#if (SPI0_MOSI_PIN_SEL == 1)
         /*  2 */  { PORTG_CLOCK_MASK, PORTG_BasePtr,  GPIOG_BasePtr,  4,  2 },
#elif (SPI0_MOSI_PIN_SEL == 2)
         /*  2 */  { PORTD_CLOCK_MASK, PORTD_BasePtr,  GPIOD_BasePtr,  3,  3 },
#else
         /*  2 */  { 0, 0, 0, 0, 0 },
#endif
   };
};

using Spi0_PCS0 = USBDM::PcrTable_T<USBDM::Spi0Info, 3>;
using Spi0_PCS1 = USBDM::PcrTable_T<USBDM::Spi0Info, 4>;
using Spi0_PCS2 = USBDM::PcrTable_T<USBDM::Spi0Info, 5>;
using Spi0_PCS3 = USBDM::PcrTable_T<USBDM::Spi0Info, 6>;
using Spi0_PCS4 = USBDM::PcrTable_T<USBDM::Spi0Info, 7>;
using Spi0_PCS5 = USBDM::PcrTable_T<USBDM::Spi0Info, 8>;
/**
 * Peripheral information for SPI, Serial Peripheral Interface
 */
class Spi1Info {
public:
   //! Hardware base pointer
   static constexpr uint32_t basePtr   = SPI1_BasePtr;

   //! Base value for PCR (excluding MUX value)
   static constexpr uint32_t pcrValue  = DEFAULT_PCR;

   //! Clock mask for peripheral
   static constexpr uint32_t clockMask = SIM_SCGC4_SPI1_MASK;

   //! Address of clock register for peripheral
   static constexpr uint32_t clockReg  = SIM_BasePtr+offsetof(SIM_Type,SCGC4);

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = 0;

   //! Information for each pin of peripheral
   static constexpr PcrInfo  info[32] = {

         //          clockMask         pcrAddress      gpioAddress gpioBit muxValue
#if (SPI1_SCK_PIN_SEL == 1)
         /*  0 */  { PORTF_CLOCK_MASK, PORTF_BasePtr,  GPIOF_BasePtr,  4,  2 },
#elif (SPI1_SCK_PIN_SEL == 2)
         /*  0 */  { PORTH_CLOCK_MASK, PORTH_BasePtr,  GPIOH_BasePtr,  7,  3 },
#else
         /*  0 */  { 0, 0, 0, 0, 0 },
#endif
#if (SPI1_MISO_PIN_SEL == 1)
         /*  1 */  { PORTF_CLOCK_MASK, PORTF_BasePtr,  GPIOF_BasePtr,  5,  2 },
#elif (SPI1_MISO_PIN_SEL == 2)
         /*  1 */  { PORTI_CLOCK_MASK, PORTI_BasePtr,  GPIOI_BasePtr,  0,  4 },
#elif (SPI1_MISO_PIN_SEL == 3)
         /*  1 */  { PORTI_CLOCK_MASK, PORTI_BasePtr,  GPIOI_BasePtr,  1,  5 },
#else
         /*  1 */  { 0, 0, 0, 0, 0 },
#endif
#if (SPI1_MOSI_PIN_SEL == 1)
         /*  2 */  { PORTF_CLOCK_MASK, PORTF_BasePtr,  GPIOF_BasePtr,  6,  2 },
#elif (SPI1_MOSI_PIN_SEL == 2)
         /*  2 */  { PORTI_CLOCK_MASK, PORTI_BasePtr,  GPIOI_BasePtr,  1,  4 },
#elif (SPI1_MOSI_PIN_SEL == 3)
         /*  2 */  { PORTI_CLOCK_MASK, PORTI_BasePtr,  GPIOI_BasePtr,  0,  5 },
#else
         /*  2 */  { 0, 0, 0, 0, 0 },
#endif
   };
};

using Spi1_PCS0 = USBDM::PcrTable_T<USBDM::Spi1Info, 3>;
using Spi1_PCS1 = USBDM::PcrTable_T<USBDM::Spi1Info, 4>;
using Spi1_PCS2 = USBDM::PcrTable_T<USBDM::Spi1Info, 5>;
using Spi1_PCS3 = USBDM::PcrTable_T<USBDM::Spi1Info, 6>;
using Spi1_PCS4 = USBDM::PcrTable_T<USBDM::Spi1Info, 7>;
using Spi1_PCS5 = USBDM::PcrTable_T<USBDM::Spi1Info, 8>;
/**
 * Peripheral information for UART, Universal Asynchonous Receiver/Transmitter
 */
class Uart0Info {
public:
   //! Hardware base pointer
   static constexpr uint32_t basePtr   = UART0_BasePtr;

